<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

  <Enumeration id="_338" name="gsm48_bcap_parity" context="_1" location="f3:67" file="f3" line="67" artificial="1" size="32" align="32">
    <EnumValue name="GSM48_BCAP_PAR_ODD" init="0"/>
    <EnumValue name="GSM48_BCAP_PAR_EVEN" init="2"/>
    <EnumValue name="GSM48_BCAP_PAR_NONE" init="3"/>
    <EnumValue name="GSM48_BCAP_PAR_ZERO" init="4"/>
    <EnumValue name="GSM48_BCAP_PAR_ONE" init="5"/>
  </Enumeration>
  <Variable id="_339" name="cpp_sym_MNCC_REL_REQ" type="_93c" init="272" context="_1" location="f1:12" file="f1" line="12" static="1"/>
  <Variable id="_340" name="cpp_sym_MNCC_F_REDIRECTING" type="_93c" init="8" context="_1" location="f1:76" file="f1" line="76" static="1"/>
  <Variable id="_341" name="cpp_sym_GSM_TCH_FRAME_AMR" type="_93c" init="771" context="_1" location="f1:18" file="f1" line="18" static="1"/>
  <Function id="_342" name="__builtin_cosf" returns="_371" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_371" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_343" name="__builtin_cosh" returns="_368" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_368" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_344" name="__builtin_cosl" returns="_372" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_372" location="f0:44" file="f0" line="44"/>
  </Function>
  <Variable id="_345" name="cpp_sym_INT8_MAX" type="_93c" init="127" context="_1" location="f1:86" file="f1" line="86" static="1"/>
  <Variable id="_346" name="cpp_sym__DEFAULT_SOURCE" type="_93c" init="1" context="_1" location="f1:94" file="f1" line="94" static="1"/>
  <Variable id="_347" name="cpp_sym_INT_FAST8_MIN" type="_93c" init="-0x00000000000000080" context="_1" location="f1:142" file="f1" line="142" static="1"/>
  <Variable id="_348" name="cpp_sym___USE_FORTIFY_LEVEL" type="_93c" init="2" context="_1" location="f1:104" file="f1" line="104" static="1"/>
  <Function id="_349" name="__builtin_isgreater" returns="_373" context="_1" location="f0:137" file="f0" line="137" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Variable id="_350" name="cpp_sym_INT_LEAST8_MAX" type="_93c" init="127" context="_1" location="f1:2" file="f1" line="2" static="1"/>
  <Variable id="_351" name="cpp_sym_MNCC_CALL_CONF_IND" type="_93c" init="263" context="_1" location="f1:81" file="f1" line="81" static="1"/>
  <Struct id="_352" name="gsm_mncc_number" context="_1" mangled="15gsm_mncc_number" demangled="gsm_mncc_number" location="f3:143" file="f3" line="143" artificial="1" size="416" align="32" members="_506 _507 _508 _509 _510 _511 _512 _513 _514 " bases=""/>
  <Function id="_353" name="__builtin_bswap32" returns="_148" context="_1" location="f0:157" file="f0" line="157" extern="1">
    <Argument name="_data" type="_148" location="f0:157" file="f0" line="157"/>
  </Function>
  <Variable id="_354" name="cpp_sym_INT8_MIN" type="_93c" init="-0x00000000000000080" context="_1" location="f1:96" file="f1" line="96" static="1"/>
  <Typedef id="_355" name="uint_least8_t" type="_276" context="_1" location="f2:76" file="f2" line="76"/>
  <Variable id="_356" name="cpp_sym_MNCC_F_PROGRESS" type="_93c" init="128" context="_1" location="f1:61" file="f1" line="61" static="1"/>
  <Variable id="_357" name="cpp_sym___GNU_LIBRARY__" type="_93c" init="6" context="_1" location="f1:9" file="f1" line="9" static="1"/>
  <Function id="_358" name="__builtin_sinf" returns="_371" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_371" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_359" name="__builtin_sinh" returns="_368" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_368" location="f0:77" file="f0" line="77"/>
  </Function>
  <Function id="_360" name="__builtin_sinl" returns="_372" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_372" location="f0:80" file="f0" line="80"/>
  </Function>
  <Typedef id="_361" name="uint64_t" type="_9" context="_1" location="f2:55" file="f2" line="55"/>
  <Function id="_362" name="__builtin_csin" returns="_384" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_384" location="f0:115" file="f0" line="115"/>
  </Function>
  <Variable id="_363" name="cpp_sym_INT_LEAST8_MIN" type="_93c" init="-0x00000000000000080" context="_1" location="f1:45" file="f1" line="45" static="1"/>
  <Variable id="_364" name="cpp_sym__POSIX_SOURCE" type="_93c" init="1" context="_1" location="f1:38" file="f1" line="38" static="1"/>
  <Variable id="_365" name="cpp_sym_UINT_LEAST32_MAX" type="_148c" init="4294967295u" context="_1" location="f1:53" file="f1" line="53" static="1"/>
  <Variable id="_366" name="cpp_sym_INTMAX_MAX" type="_48c" init="9223372036854775807l" context="_1" location="f1:36" file="f1" line="36" static="1"/>
  <Variable id="_367" name="cpp_sym_GSM_TCHH_FRAME" type="_93c" init="770" context="_1" location="f1:5" file="f1" line="5" static="1"/>
  <FundamentalType id="_368" name="double" size="64" align="64"/>
  <PointerType id="_369" type="_515c" size="64" align="64"/>
  <CvQualifiedType id="_93c" type="_93" const="1"/>
  <FundamentalType id="_371" name="float" size="32" align="32"/>
  <FundamentalType id="_372" name="long double" size="128" align="128"/>
  <FundamentalType id="_373" name="bool" size="8" align="8"/>
  <FundamentalType id="_374" name="long long int" size="64" align="64"/>
  <FundamentalType id="_375" name="complex float" size="64" align="32"/>
  <FundamentalType id="_376" name="complex long double" size="256" align="128"/>
  <CvQualifiedType id="_48c" type="_48" const="1"/>
  <Field id="_378" name="dtmf" type="_93" offset="0" context="_27" access="public" location="f3:183" file="f3" line="183"/>
  <Field id="_379" name="pcp" type="_93" offset="32" context="_27" access="public" location="f3:184" file="f3" line="184"/>
  <Destructor id="_380" name="gsm_mncc_cccap" artificial="1" throw="" context="_27" access="public" mangled="_ZN14gsm_mncc_cccapD1Ev *INTERNAL* " demangled="gsm_mncc_cccap::~gsm_mncc_cccap()" location="f3:182" file="f3" line="182" endline="182" inline="1">
  </Destructor>
  <OperatorMethod id="_381" name="=" returns="_517" artificial="1" throw="" context="_27" access="public" mangled="_ZN14gsm_mncc_cccapaSERKS_" demangled="gsm_mncc_cccap::operator=(gsm_mncc_cccap const&amp;)" location="f3:182" file="f3" line="182" endline="182" inline="1">
    <Argument type="_518" location="f3:182" file="f3" line="182"/>
  </OperatorMethod>
  <Constructor id="_382" name="gsm_mncc_cccap" artificial="1" throw="" context="_27" access="public" mangled="_ZN14gsm_mncc_cccapC1ERKS_ *INTERNAL* " demangled="gsm_mncc_cccap::gsm_mncc_cccap(gsm_mncc_cccap const&amp;)" location="f3:182" file="f3" line="182" endline="182" inline="1">
    <Argument type="_518" location="f3:182" file="f3" line="182"/>
  </Constructor>
  <Constructor id="_383" name="gsm_mncc_cccap" artificial="1" throw="" context="_27" access="public" mangled="_ZN14gsm_mncc_cccapC1Ev *INTERNAL* " demangled="gsm_mncc_cccap::gsm_mncc_cccap()" location="f3:182" file="f3" line="182" inline="1"/>
  <FundamentalType id="_384" name="complex double" size="128" align="64"/>
  <Field id="_385" name="len" type="_93" offset="0" context="_60" access="public" location="f3:173" file="f3" line="173"/>
  <Field id="_386" name="info" type="_519" offset="32" context="_60" access="public" location="f3:174" file="f3" line="174"/>
  <Destructor id="_387" name="gsm_mncc_facility" artificial="1" throw="" context="_60" access="public" mangled="_ZN17gsm_mncc_facilityD1Ev *INTERNAL* " demangled="gsm_mncc_facility::~gsm_mncc_facility()" location="f3:172" file="f3" line="172" endline="172" inline="1">
  </Destructor>
  <OperatorMethod id="_388" name="=" returns="_520" artificial="1" throw="" context="_60" access="public" mangled="_ZN17gsm_mncc_facilityaSERKS_" demangled="gsm_mncc_facility::operator=(gsm_mncc_facility const&amp;)" location="f3:172" file="f3" line="172" endline="172" inline="1">
    <Argument type="_521" location="f3:172" file="f3" line="172"/>
  </OperatorMethod>
  <Constructor id="_389" name="gsm_mncc_facility" artificial="1" throw="" context="_60" access="public" mangled="_ZN17gsm_mncc_facilityC1ERKS_ *INTERNAL* " demangled="gsm_mncc_facility::gsm_mncc_facility(gsm_mncc_facility const&amp;)" location="f3:172" file="f3" line="172" endline="172" inline="1">
    <Argument type="_521" location="f3:172" file="f3" line="172"/>
  </Constructor>
  <Constructor id="_390" name="gsm_mncc_facility" artificial="1" throw="" context="_60" access="public" mangled="_ZN17gsm_mncc_facilityC1Ev *INTERNAL* " demangled="gsm_mncc_facility::gsm_mncc_facility()" location="f3:172" file="f3" line="172" inline="1"/>
  <CvQualifiedType id="_9c" type="_9" const="1"/>
  <Field id="_392" name="msg_type" type="_149" offset="0" context="_83" access="public" location="f3:314" file="f3" line="314"/>
  <Field id="_393" name="callref" type="_149" offset="32" context="_83" access="public" location="f3:315" file="f3" line="315"/>
  <Field id="_394" name="data" type="_522" offset="64" context="_83" access="public" location="f3:316" file="f3" line="316"/>
  <Destructor id="_395" name="gsm_data_frame" artificial="1" throw="" context="_83" access="public" mangled="_ZN14gsm_data_frameD1Ev *INTERNAL* " demangled="gsm_data_frame::~gsm_data_frame()" location="f3:313" file="f3" line="313" endline="313" inline="1">
  </Destructor>
  <OperatorMethod id="_396" name="=" returns="_523" artificial="1" throw="" context="_83" access="public" mangled="_ZN14gsm_data_frameaSERKS_" demangled="gsm_data_frame::operator=(gsm_data_frame const&amp;)" location="f3:313" file="f3" line="313" endline="313" inline="1">
    <Argument type="_524" location="f3:313" file="f3" line="313"/>
  </OperatorMethod>
  <Constructor id="_397" name="gsm_data_frame" artificial="1" throw="" context="_83" access="public" mangled="_ZN14gsm_data_frameC1ERKS_ *INTERNAL* " demangled="gsm_data_frame::gsm_data_frame(gsm_data_frame const&amp;)" location="f3:313" file="f3" line="313" endline="313" inline="1">
    <Argument type="_524" location="f3:313" file="f3" line="313"/>
  </Constructor>
  <Constructor id="_398" name="gsm_data_frame" artificial="1" throw="" context="_83" access="public" mangled="_ZN14gsm_data_frameC1Ev *INTERNAL* " demangled="gsm_data_frame::gsm_data_frame()" location="f3:313" file="f3" line="313" inline="1"/>
  <FundamentalType id="_399" name="void" align="8"/>
  <PointerType id="_400" type="_399" size="64" align="64"/>
  <Field id="_401" name="len" type="_93" offset="0" context="_87" access="public" location="f3:178" file="f3" line="178"/>
  <Field id="_402" name="info" type="_519" offset="32" context="_87" access="public" location="f3:179" file="f3" line="179"/>
  <Destructor id="_403" name="gsm_mncc_ssversion" artificial="1" throw="" context="_87" access="public" mangled="_ZN18gsm_mncc_ssversionD1Ev *INTERNAL* " demangled="gsm_mncc_ssversion::~gsm_mncc_ssversion()" location="f3:177" file="f3" line="177" endline="177" inline="1">
  </Destructor>
  <OperatorMethod id="_404" name="=" returns="_525" artificial="1" throw="" context="_87" access="public" mangled="_ZN18gsm_mncc_ssversionaSERKS_" demangled="gsm_mncc_ssversion::operator=(gsm_mncc_ssversion const&amp;)" location="f3:177" file="f3" line="177" endline="177" inline="1">
    <Argument type="_526" location="f3:177" file="f3" line="177"/>
  </OperatorMethod>
  <Constructor id="_405" name="gsm_mncc_ssversion" artificial="1" throw="" context="_87" access="public" mangled="_ZN18gsm_mncc_ssversionC1ERKS_ *INTERNAL* " demangled="gsm_mncc_ssversion::gsm_mncc_ssversion(gsm_mncc_ssversion const&amp;)" location="f3:177" file="f3" line="177" endline="177" inline="1">
    <Argument type="_526" location="f3:177" file="f3" line="177"/>
  </Constructor>
  <Constructor id="_406" name="gsm_mncc_ssversion" artificial="1" throw="" context="_87" access="public" mangled="_ZN18gsm_mncc_ssversionC1Ev *INTERNAL* " demangled="gsm_mncc_ssversion::gsm_mncc_ssversion()" location="f3:177" file="f3" line="177" inline="1"/>
  <PointerType id="_407" type="_399c" size="64" align="64"/>
  <PointerType id="_408" type="_93" size="64" align="64"/>
  <CvQualifiedType id="_148c" type="_148" const="1"/>
  <Field id="_410" name="coding" type="_93" offset="0" context="_132" access="public" location="f3:167" file="f3" line="167"/>
  <Field id="_411" name="location" type="_93" offset="32" context="_132" access="public" location="f3:168" file="f3" line="168"/>
  <Field id="_412" name="descr" type="_93" offset="64" context="_132" access="public" location="f3:169" file="f3" line="169"/>
  <Destructor id="_413" name="gsm_mncc_progress" artificial="1" throw="" context="_132" access="public" mangled="_ZN17gsm_mncc_progressD1Ev *INTERNAL* " demangled="gsm_mncc_progress::~gsm_mncc_progress()" location="f3:166" file="f3" line="166" endline="166" inline="1">
  </Destructor>
  <OperatorMethod id="_414" name="=" returns="_528" artificial="1" throw="" context="_132" access="public" mangled="_ZN17gsm_mncc_progressaSERKS_" demangled="gsm_mncc_progress::operator=(gsm_mncc_progress const&amp;)" location="f3:166" file="f3" line="166" endline="166" inline="1">
    <Argument type="_529" location="f3:166" file="f3" line="166"/>
  </OperatorMethod>
  <Constructor id="_415" name="gsm_mncc_progress" artificial="1" throw="" context="_132" access="public" mangled="_ZN17gsm_mncc_progressC1ERKS_ *INTERNAL* " demangled="gsm_mncc_progress::gsm_mncc_progress(gsm_mncc_progress const&amp;)" location="f3:166" file="f3" line="166" endline="166" inline="1">
    <Argument type="_529" location="f3:166" file="f3" line="166"/>
  </Constructor>
  <Constructor id="_416" name="gsm_mncc_progress" artificial="1" throw="" context="_132" access="public" mangled="_ZN17gsm_mncc_progressC1Ev *INTERNAL* " demangled="gsm_mncc_progress::gsm_mncc_progress()" location="f3:166" file="f3" line="166" inline="1"/>
  <Field id="_417" name="location" type="_93" offset="0" context="_133" access="public" location="f3:152" file="f3" line="152"/>
  <Field id="_418" name="coding" type="_93" offset="32" context="_133" access="public" location="f3:153" file="f3" line="153"/>
  <Field id="_419" name="rec" type="_93" offset="64" context="_133" access="public" location="f3:154" file="f3" line="154"/>
  <Field id="_420" name="rec_val" type="_93" offset="96" context="_133" access="public" location="f3:155" file="f3" line="155"/>
  <Field id="_421" name="value" type="_93" offset="128" context="_133" access="public" location="f3:156" file="f3" line="156"/>
  <Field id="_422" name="diag_len" type="_93" offset="160" context="_133" access="public" location="f3:157" file="f3" line="157"/>
  <Field id="_423" name="diag" type="_530" offset="192" context="_133" access="public" location="f3:158" file="f3" line="158"/>
  <Destructor id="_424" name="gsm_mncc_cause" artificial="1" throw="" context="_133" access="public" mangled="_ZN14gsm_mncc_causeD1Ev *INTERNAL* " demangled="gsm_mncc_cause::~gsm_mncc_cause()" location="f3:151" file="f3" line="151" endline="151" inline="1">
  </Destructor>
  <OperatorMethod id="_425" name="=" returns="_531" artificial="1" throw="" context="_133" access="public" mangled="_ZN14gsm_mncc_causeaSERKS_" demangled="gsm_mncc_cause::operator=(gsm_mncc_cause const&amp;)" location="f3:151" file="f3" line="151" endline="151" inline="1">
    <Argument type="_532" location="f3:151" file="f3" line="151"/>
  </OperatorMethod>
  <Constructor id="_426" name="gsm_mncc_cause" artificial="1" throw="" context="_133" access="public" mangled="_ZN14gsm_mncc_causeC1ERKS_ *INTERNAL* " demangled="gsm_mncc_cause::gsm_mncc_cause(gsm_mncc_cause const&amp;)" location="f3:151" file="f3" line="151" endline="151" inline="1">
    <Argument type="_532" location="f3:151" file="f3" line="151"/>
  </Constructor>
  <Constructor id="_427" name="gsm_mncc_cause" artificial="1" throw="" context="_133" access="public" mangled="_ZN14gsm_mncc_causeC1Ev *INTERNAL* " demangled="gsm_mncc_cause::gsm_mncc_cause()" location="f3:151" file="f3" line="151" inline="1"/>
  <PointerType id="_428" type="_371" size="64" align="64"/>
  <PointerType id="_429" type="_372" size="64" align="64"/>
  <Field id="_430" name="msg_type" type="_149" offset="0" context="_229" access="public" location="f3:346" file="f3" line="346"/>
  <Field id="_431" name="callref" type="_533" offset="32" context="_229" access="public" location="f3:347" file="f3" line="347"/>
  <Destructor id="_432" name="gsm_mncc_bridge" artificial="1" throw="" context="_229" access="public" mangled="_ZN15gsm_mncc_bridgeD1Ev *INTERNAL* " demangled="gsm_mncc_bridge::~gsm_mncc_bridge()" location="f3:345" file="f3" line="345" endline="345" inline="1">
  </Destructor>
  <OperatorMethod id="_433" name="=" returns="_534" artificial="1" throw="" context="_229" access="public" mangled="_ZN15gsm_mncc_bridgeaSERKS_" demangled="gsm_mncc_bridge::operator=(gsm_mncc_bridge const&amp;)" location="f3:345" file="f3" line="345" endline="345" inline="1">
    <Argument type="_535" location="f3:345" file="f3" line="345"/>
  </OperatorMethod>
  <Constructor id="_434" name="gsm_mncc_bridge" artificial="1" throw="" context="_229" access="public" mangled="_ZN15gsm_mncc_bridgeC1ERKS_ *INTERNAL* " demangled="gsm_mncc_bridge::gsm_mncc_bridge(gsm_mncc_bridge const&amp;)" location="f3:345" file="f3" line="345" endline="345" inline="1">
    <Argument type="_535" location="f3:345" file="f3" line="345"/>
  </Constructor>
  <Constructor id="_435" name="gsm_mncc_bridge" artificial="1" throw="" context="_229" access="public" mangled="_ZN15gsm_mncc_bridgeC1Ev *INTERNAL* " demangled="gsm_mncc_bridge::gsm_mncc_bridge()" location="f3:345" file="f3" line="345" inline="1"/>
  <Field id="_436" name="proto" type="_93" offset="0" context="_235" access="public" location="f3:162" file="f3" line="162"/>
  <Field id="_437" name="info" type="_536" offset="32" context="_235" access="public" location="f3:163" file="f3" line="163"/>
  <Destructor id="_438" name="gsm_mncc_useruser" artificial="1" throw="" context="_235" access="public" mangled="_ZN17gsm_mncc_useruserD1Ev *INTERNAL* " demangled="gsm_mncc_useruser::~gsm_mncc_useruser()" location="f3:161" file="f3" line="161" endline="161" inline="1">
  </Destructor>
  <OperatorMethod id="_439" name="=" returns="_537" artificial="1" throw="" context="_235" access="public" mangled="_ZN17gsm_mncc_useruseraSERKS_" demangled="gsm_mncc_useruser::operator=(gsm_mncc_useruser const&amp;)" location="f3:161" file="f3" line="161" endline="161" inline="1">
    <Argument type="_538" location="f3:161" file="f3" line="161"/>
  </OperatorMethod>
  <Constructor id="_440" name="gsm_mncc_useruser" artificial="1" throw="" context="_235" access="public" mangled="_ZN17gsm_mncc_useruserC1ERKS_ *INTERNAL* " demangled="gsm_mncc_useruser::gsm_mncc_useruser(gsm_mncc_useruser const&amp;)" location="f3:161" file="f3" line="161" endline="161" inline="1">
    <Argument type="_538" location="f3:161" file="f3" line="161"/>
  </Constructor>
  <Constructor id="_441" name="gsm_mncc_useruser" artificial="1" throw="" context="_235" access="public" mangled="_ZN17gsm_mncc_useruserC1Ev *INTERNAL* " demangled="gsm_mncc_useruser::gsm_mncc_useruser()" location="f3:161" file="f3" line="161" inline="1"/>
  <Field id="_442" name="transfer" type="_93" offset="0" context="_241" access="public" location="f3:123" file="f3" line="123"/>
  <Field id="_443" name="mode" type="_93" offset="32" context="_241" access="public" location="f3:124" file="f3" line="124"/>
  <Field id="_444" name="coding" type="_93" offset="64" context="_241" access="public" location="f3:125" file="f3" line="125"/>
  <Field id="_445" name="radio" type="_93" offset="96" context="_241" access="public" location="f3:126" file="f3" line="126"/>
  <Field id="_446" name="speech_ctm" type="_93" offset="128" context="_241" access="public" location="f3:127" file="f3" line="127"/>
  <Field id="_447" name="speech_ver" type="_539" offset="160" context="_241" access="public" location="f3:128" file="f3" line="128"/>
  <Field id="_448" name="data" type="_449" offset="416" context="_241" access="public" location="f3:140" file="f3" line="140"/>
  <Struct id="_449" context="_241" access="public" mangled="N19gsm_mncc_bearer_cap3._0E" demangled="gsm_mncc_bearer_cap::._0" location="f3:129" file="f3" line="129" artificial="1" size="320" align="32" members="_540 _541 _542 _543 _544 _545 _546 _547 _548 _549 _550 _551 _552 _553 " bases=""/>
  <Destructor id="_450" name="gsm_mncc_bearer_cap" artificial="1" throw="" context="_241" access="public" mangled="_ZN19gsm_mncc_bearer_capD1Ev *INTERNAL* " demangled="gsm_mncc_bearer_cap::~gsm_mncc_bearer_cap()" location="f3:122" file="f3" line="122" endline="122" inline="1">
  </Destructor>
  <OperatorMethod id="_451" name="=" returns="_554" artificial="1" throw="" context="_241" access="public" mangled="_ZN19gsm_mncc_bearer_capaSERKS_" demangled="gsm_mncc_bearer_cap::operator=(gsm_mncc_bearer_cap const&amp;)" location="f3:122" file="f3" line="122" endline="122" inline="1">
    <Argument type="_555" location="f3:122" file="f3" line="122"/>
  </OperatorMethod>
  <Constructor id="_452" name="gsm_mncc_bearer_cap" artificial="1" throw="" context="_241" access="public" mangled="_ZN19gsm_mncc_bearer_capC1ERKS_ *INTERNAL* " demangled="gsm_mncc_bearer_cap::gsm_mncc_bearer_cap(gsm_mncc_bearer_cap const&amp;)" location="f3:122" file="f3" line="122" endline="122" inline="1">
    <Argument type="_555" location="f3:122" file="f3" line="122"/>
  </Constructor>
  <Constructor id="_453" name="gsm_mncc_bearer_cap" artificial="1" throw="" context="_241" access="public" mangled="_ZN19gsm_mncc_bearer_capC1Ev *INTERNAL* " demangled="gsm_mncc_bearer_cap::gsm_mncc_bearer_cap()" location="f3:122" file="f3" line="122" inline="1"/>
  <Field id="_454" name="msg_type" type="_149" offset="0" context="_258" access="public" location="f3:336" file="f3" line="336"/>
  <Field id="_455" name="callref" type="_149" offset="32" context="_258" access="public" location="f3:337" file="f3" line="337"/>
  <Field id="_456" name="ip" type="_149" offset="64" context="_258" access="public" location="f3:338" file="f3" line="338"/>
  <Field id="_457" name="port" type="_266" offset="96" context="_258" access="public" location="f3:339" file="f3" line="339"/>
  <Field id="_458" name="payload_type" type="_149" offset="128" context="_258" access="public" location="f3:340" file="f3" line="340"/>
  <Field id="_459" name="payload_msg_type" type="_149" offset="160" context="_258" access="public" location="f3:341" file="f3" line="341"/>
  <Field id="_460" name="sdp" type="_556" offset="192" context="_258" access="public" location="f3:342" file="f3" line="342"/>
  <Destructor id="_461" name="gsm_mncc_rtp" artificial="1" throw="" context="_258" access="public" mangled="_ZN12gsm_mncc_rtpD1Ev *INTERNAL* " demangled="gsm_mncc_rtp::~gsm_mncc_rtp()" location="f3:335" file="f3" line="335" endline="335" inline="1">
  </Destructor>
  <OperatorMethod id="_462" name="=" returns="_557" artificial="1" throw="" context="_258" access="public" mangled="_ZN12gsm_mncc_rtpaSERKS_" demangled="gsm_mncc_rtp::operator=(gsm_mncc_rtp const&amp;)" location="f3:335" file="f3" line="335" endline="335" inline="1">
    <Argument type="_558" location="f3:335" file="f3" line="335"/>
  </OperatorMethod>
  <Constructor id="_463" name="gsm_mncc_rtp" artificial="1" throw="" context="_258" access="public" mangled="_ZN12gsm_mncc_rtpC1ERKS_ *INTERNAL* " demangled="gsm_mncc_rtp::gsm_mncc_rtp(gsm_mncc_rtp const&amp;)" location="f3:335" file="f3" line="335" endline="335" inline="1">
    <Argument type="_558" location="f3:335" file="f3" line="335"/>
  </Constructor>
  <Constructor id="_464" name="gsm_mncc_rtp" artificial="1" throw="" context="_258" access="public" mangled="_ZN12gsm_mncc_rtpC1Ev *INTERNAL* " demangled="gsm_mncc_rtp::gsm_mncc_rtp()" location="f3:335" file="f3" line="335" inline="1"/>
  <Field id="_465" name="msg_type" type="_149" offset="0" context="_269" access="public" location="f3:276" file="f3" line="276"/>
  <Field id="_466" name="callref" type="_149" offset="32" context="_269" access="public" location="f3:277" file="f3" line="277"/>
  <Field id="_467" name="fields" type="_149" offset="64" context="_269" access="public" location="f3:280" file="f3" line="280"/>
  <Field id="_468" name="bearer_cap" type="_241" offset="96" context="_269" access="public" location="f3:283" file="f3" line="283"/>
  <Field id="_469" name="called" type="_352" offset="832" context="_269" access="public" location="f3:284" file="f3" line="284"/>
  <Field id="_470" name="calling" type="_352" offset="1248" context="_269" access="public" location="f3:285" file="f3" line="285"/>
  <Field id="_471" name="redirecting" type="_352" offset="1664" context="_269" access="public" location="f3:286" file="f3" line="286"/>
  <Field id="_472" name="connected" type="_352" offset="2080" context="_269" access="public" location="f3:287" file="f3" line="287"/>
  <Field id="_473" name="cause" type="_133" offset="2496" context="_269" access="public" location="f3:288" file="f3" line="288"/>
  <Field id="_474" name="progress" type="_132" offset="2944" context="_269" access="public" location="f3:289" file="f3" line="289"/>
  <Field id="_475" name="useruser" type="_235" offset="3040" context="_269" access="public" location="f3:290" file="f3" line="290"/>
  <Field id="_476" name="facility" type="_60" offset="4128" context="_269" access="public" location="f3:291" file="f3" line="291"/>
  <Field id="_477" name="cccap" type="_27" offset="5184" context="_269" access="public" location="f3:292" file="f3" line="292"/>
  <Field id="_478" name="ssversion" type="_87" offset="5248" context="_269" access="public" location="f3:293" file="f3" line="293"/>
  <Field id="_479" name="clir" type="_489" offset="6304" context="_269" access="public" location="f3:297" file="f3" line="297"/>
  <Field id="_480" name="signal" type="_93" offset="6368" context="_269" access="public" location="f3:298" file="f3" line="298"/>
  <Field id="_481" name="keypad" type="_93" offset="6400" context="_269" access="public" location="f3:301" file="f3" line="301"/>
  <Field id="_482" name="more" type="_93" offset="6432" context="_269" access="public" location="f3:302" file="f3" line="302"/>
  <Field id="_483" name="notify" type="_93" offset="6464" context="_269" access="public" location="f3:303" file="f3" line="303"/>
  <Field id="_484" name="emergency" type="_93" offset="6496" context="_269" access="public" location="f3:304" file="f3" line="304"/>
  <Field id="_485" name="imsi" type="_559" offset="6528" context="_269" access="public" location="f3:305" file="f3" line="305"/>
  <Field id="_486" name="lchan_type" type="_276" offset="6656" context="_269" access="public" location="f3:307" file="f3" line="307"/>
  <Field id="_487" name="lchan_mode" type="_276" offset="6664" context="_269" access="public" location="f3:308" file="f3" line="308"/>
  <Field id="_488" name="sdp" type="_556" offset="6672" context="_269" access="public" location="f3:310" file="f3" line="310"/>
  <Struct id="_489" context="_269" access="public" mangled="N8gsm_mncc3._2E" demangled="gsm_mncc::._2" location="f3:294" file="f3" line="294" artificial="1" size="64" align="32" members="_560 _561 _562 _563 _564 _565 " bases=""/>
  <Destructor id="_490" name="gsm_mncc" artificial="1" throw="" context="_269" access="public" mangled="_ZN8gsm_mnccD1Ev *INTERNAL* " demangled="gsm_mncc::~gsm_mncc()" location="f3:274" file="f3" line="274" endline="274" inline="1">
  </Destructor>
  <OperatorMethod id="_491" name="=" returns="_566" artificial="1" throw="" context="_269" access="public" mangled="_ZN8gsm_mnccaSERKS_" demangled="gsm_mncc::operator=(gsm_mncc const&amp;)" location="f3:274" file="f3" line="274" endline="274" inline="1">
    <Argument type="_567" location="f3:274" file="f3" line="274"/>
  </OperatorMethod>
  <Constructor id="_492" name="gsm_mncc" artificial="1" throw="" context="_269" access="public" mangled="_ZN8gsm_mnccC1ERKS_ *INTERNAL* " demangled="gsm_mncc::gsm_mncc(gsm_mncc const&amp;)" location="f3:274" file="f3" line="274" endline="274" inline="1">
    <Argument type="_567" location="f3:274" file="f3" line="274"/>
  </Constructor>
  <Constructor id="_493" name="gsm_mncc" artificial="1" throw="" context="_269" access="public" mangled="_ZN8gsm_mnccC1Ev *INTERNAL* " demangled="gsm_mncc::gsm_mncc()" location="f3:274" file="f3" line="274" inline="1"/>
  <Field id="_494" name="msg_type" type="_149" offset="0" context="_332" access="public" location="f3:321" file="f3" line="321"/>
  <Field id="_495" name="version" type="_149" offset="32" context="_332" access="public" location="f3:322" file="f3" line="322"/>
  <Field id="_496" name="mncc_size" type="_149" offset="64" context="_332" access="public" location="f3:325" file="f3" line="325"/>
  <Field id="_497" name="data_frame_size" type="_149" offset="96" context="_332" access="public" location="f3:326" file="f3" line="326"/>
  <Field id="_498" name="called_offset" type="_149" offset="128" context="_332" access="public" location="f3:329" file="f3" line="329"/>
  <Field id="_499" name="signal_offset" type="_149" offset="160" context="_332" access="public" location="f3:330" file="f3" line="330"/>
  <Field id="_500" name="emergency_offset" type="_149" offset="192" context="_332" access="public" location="f3:331" file="f3" line="331"/>
  <Field id="_501" name="lchan_type_offset" type="_149" offset="224" context="_332" access="public" location="f3:332" file="f3" line="332"/>
  <Destructor id="_502" name="gsm_mncc_hello" artificial="1" throw="" context="_332" access="public" mangled="_ZN14gsm_mncc_helloD1Ev *INTERNAL* " demangled="gsm_mncc_hello::~gsm_mncc_hello()" location="f3:320" file="f3" line="320" endline="320" inline="1">
  </Destructor>
  <OperatorMethod id="_503" name="=" returns="_568" artificial="1" throw="" context="_332" access="public" mangled="_ZN14gsm_mncc_helloaSERKS_" demangled="gsm_mncc_hello::operator=(gsm_mncc_hello const&amp;)" location="f3:320" file="f3" line="320" endline="320" inline="1">
    <Argument type="_569" location="f3:320" file="f3" line="320"/>
  </OperatorMethod>
  <Constructor id="_504" name="gsm_mncc_hello" artificial="1" throw="" context="_332" access="public" mangled="_ZN14gsm_mncc_helloC1ERKS_ *INTERNAL* " demangled="gsm_mncc_hello::gsm_mncc_hello(gsm_mncc_hello const&amp;)" location="f3:320" file="f3" line="320" endline="320" inline="1">
    <Argument type="_569" location="f3:320" file="f3" line="320"/>
  </Constructor>
  <Constructor id="_505" name="gsm_mncc_hello" artificial="1" throw="" context="_332" access="public" mangled="_ZN14gsm_mncc_helloC1Ev *INTERNAL* " demangled="gsm_mncc_hello::gsm_mncc_hello()" location="f3:320" file="f3" line="320" inline="1"/>
  <Field id="_506" name="type" type="_93" offset="0" context="_352" access="public" location="f3:144" file="f3" line="144"/>
  <Field id="_507" name="plan" type="_93" offset="32" context="_352" access="public" location="f3:145" file="f3" line="145"/>
  <Field id="_508" name="present" type="_93" offset="64" context="_352" access="public" location="f3:146" file="f3" line="146"/>
  <Field id="_509" name="screen" type="_93" offset="96" context="_352" access="public" location="f3:147" file="f3" line="147"/>
  <Field id="_510" name="number" type="_570" offset="128" context="_352" access="public" location="f3:148" file="f3" line="148"/>
  <Destructor id="_511" name="gsm_mncc_number" artificial="1" throw="" context="_352" access="public" mangled="_ZN15gsm_mncc_numberD1Ev *INTERNAL* " demangled="gsm_mncc_number::~gsm_mncc_number()" location="f3:143" file="f3" line="143" endline="143" inline="1">
  </Destructor>
  <OperatorMethod id="_512" name="=" returns="_571" artificial="1" throw="" context="_352" access="public" mangled="_ZN15gsm_mncc_numberaSERKS_" demangled="gsm_mncc_number::operator=(gsm_mncc_number const&amp;)" location="f3:143" file="f3" line="143" endline="143" inline="1">
    <Argument type="_572" location="f3:143" file="f3" line="143"/>
  </OperatorMethod>
  <Constructor id="_513" name="gsm_mncc_number" artificial="1" throw="" context="_352" access="public" mangled="_ZN15gsm_mncc_numberC1ERKS_ *INTERNAL* " demangled="gsm_mncc_number::gsm_mncc_number(gsm_mncc_number const&amp;)" location="f3:143" file="f3" line="143" endline="143" inline="1">
    <Argument type="_572" location="f3:143" file="f3" line="143"/>
  </Constructor>
  <Constructor id="_514" name="gsm_mncc_number" artificial="1" throw="" context="_352" access="public" mangled="_ZN15gsm_mncc_numberC1Ev *INTERNAL* " demangled="gsm_mncc_number::gsm_mncc_number()" location="f3:143" file="f3" line="143" inline="1"/>
  <ReferenceType id="_517" type="_27" size="64" align="64"/>
  <ReferenceType id="_518" type="_27c" size="64" align="64"/>
  <ArrayType id="_519" min="0" max="127u" type="_515" size="1024" align="8"/>
  <ReferenceType id="_520" type="_60" size="64" align="64"/>
  <ReferenceType id="_521" type="_60c" size="64" align="64"/>
  <ArrayType id="_522" min="0" max="0xffffffffffffffffffffffffffffffffu" type="_276" size="0" align="8"/>
  <ReferenceType id="_523" type="_83" size="64" align="64"/>
  <ReferenceType id="_524" type="_83c" size="64" align="64"/>
  <ReferenceType id="_525" type="_87" size="64" align="64"/>
  <ReferenceType id="_526" type="_87c" size="64" align="64"/>
  <ReferenceType id="_528" type="_132" size="64" align="64"/>
  <ReferenceType id="_529" type="_132c" size="64" align="64"/>
  <ArrayType id="_530" min="0" max="31u" type="_515" size="256" align="8"/>
  <ReferenceType id="_531" type="_133" size="64" align="64"/>
  <ReferenceType id="_532" type="_133c" size="64" align="64"/>
  <ArrayType id="_533" min="0" max="1u" type="_149" size="64" align="32"/>
  <ReferenceType id="_534" type="_229" size="64" align="64"/>
  <ReferenceType id="_535" type="_229c" size="64" align="64"/>
  <ArrayType id="_536" min="0" max="128u" type="_515" size="1032" align="8"/>
  <ReferenceType id="_537" type="_235" size="64" align="64"/>
  <ReferenceType id="_538" type="_235c" size="64" align="64"/>
  <ArrayType id="_539" min="0" max="7u" type="_93" size="256" align="32"/>
  <Field id="_540" name="rate_adaption" type="_105" offset="0" context="_449" access="public" location="f3:130" file="f3" line="130"/>
  <Field id="_541" name="sig_access" type="_71" offset="32" context="_449" access="public" location="f3:131" file="f3" line="131"/>
  <Field id="_542" name="async" type="_93" offset="64" context="_449" access="public" location="f3:132" file="f3" line="132"/>
  <Field id="_543" name="nr_stop_bits" type="_93" offset="96" context="_449" access="public" location="f3:133" file="f3" line="133"/>
  <Field id="_544" name="nr_data_bits" type="_93" offset="128" context="_449" access="public" location="f3:134" file="f3" line="134"/>
  <Field id="_545" name="user_rate" type="_169" offset="160" context="_449" access="public" location="f3:135" file="f3" line="135"/>
  <Field id="_546" name="parity" type="_338" offset="192" context="_449" access="public" location="f3:136" file="f3" line="136"/>
  <Field id="_547" name="interm_rate" type="_303" offset="224" context="_449" access="public" location="f3:137" file="f3" line="137"/>
  <Field id="_548" name="transp" type="_141" offset="256" context="_449" access="public" location="f3:138" file="f3" line="138"/>
  <Field id="_549" name="modem_type" type="_154" offset="288" context="_449" access="public" location="f3:139" file="f3" line="139"/>
  <Destructor id="_550" name="._0" artificial="1" throw="" context="_449" access="public" mangled="_ZN19gsm_mncc_bearer_cap3._0D1Ev *INTERNAL* " demangled="gsm_mncc_bearer_cap::._0::~._0()" location="f3:129" file="f3" line="129" endline="129" inline="1">
  </Destructor>
  <OperatorMethod id="_551" name="=" returns="_581" artificial="1" throw="" context="_449" access="public" mangled="_ZN19gsm_mncc_bearer_cap3._0aSERKS0_" demangled="gsm_mncc_bearer_cap::._0::operator=(gsm_mncc_bearer_cap::._0 const&amp;)" location="f3:129" file="f3" line="129" endline="129" inline="1">
    <Argument type="_582" location="f3:129" file="f3" line="129"/>
  </OperatorMethod>
  <Constructor id="_552" artificial="1" throw="" context="_449" access="public" mangled="_ZN19gsm_mncc_bearer_cap3._0C1ERKS0_ *INTERNAL* " demangled="gsm_mncc_bearer_cap::._0::._0(gsm_mncc_bearer_cap::._0 const&amp;)" location="f3:129" file="f3" line="129" endline="129" inline="1">
    <Argument type="_582" location="f3:129" file="f3" line="129"/>
  </Constructor>
  <Constructor id="_553" artificial="1" throw="" context="_449" access="public" mangled="_ZN19gsm_mncc_bearer_cap3._0C1Ev *INTERNAL* " demangled="gsm_mncc_bearer_cap::._0::._0()" location="f3:129" file="f3" line="129" inline="1"/>
  <ReferenceType id="_554" type="_241" size="64" align="64"/>
  <ReferenceType id="_555" type="_241c" size="64" align="64"/>
  <ArrayType id="_556" min="0" max="1023u" type="_515" size="8192" align="8"/>
  <ReferenceType id="_557" type="_258" size="64" align="64"/>
  <ReferenceType id="_558" type="_258c" size="64" align="64"/>
  <ArrayType id="_559" min="0" max="15u" type="_515" size="128" align="8"/>
  <Field id="_560" name="sup" type="_93" offset="0" context="_489" access="public" location="f3:295" file="f3" line="295"/>
  <Field id="_561" name="inv" type="_93" offset="32" context="_489" access="public" location="f3:296" file="f3" line="296"/>
  <Destructor id="_562" name="._2" artificial="1" throw="" context="_489" access="public" mangled="_ZN8gsm_mncc3._2D1Ev *INTERNAL* " demangled="gsm_mncc::._2::~._2()" location="f3:294" file="f3" line="294" endline="294" inline="1">
  </Destructor>
  <OperatorMethod id="_563" name="=" returns="_585" artificial="1" throw="" context="_489" access="public" mangled="_ZN8gsm_mncc3._2aSERKS0_" demangled="gsm_mncc::._2::operator=(gsm_mncc::._2 const&amp;)" location="f3:294" file="f3" line="294" endline="294" inline="1">
    <Argument type="_586" location="f3:294" file="f3" line="294"/>
  </OperatorMethod>
  <Constructor id="_564" artificial="1" throw="" context="_489" access="public" mangled="_ZN8gsm_mncc3._2C1ERKS0_ *INTERNAL* " demangled="gsm_mncc::._2::._2(gsm_mncc::._2 const&amp;)" location="f3:294" file="f3" line="294" endline="294" inline="1">
    <Argument type="_586" location="f3:294" file="f3" line="294"/>
  </Constructor>
  <Constructor id="_565" artificial="1" throw="" context="_489" access="public" mangled="_ZN8gsm_mncc3._2C1Ev *INTERNAL* " demangled="gsm_mncc::._2::._2()" location="f3:294" file="f3" line="294" inline="1"/>
  <ReferenceType id="_566" type="_269" size="64" align="64"/>
  <ReferenceType id="_567" type="_269c" size="64" align="64"/>
  <ReferenceType id="_568" type="_332" size="64" align="64"/>
  <ReferenceType id="_569" type="_332c" size="64" align="64"/>
  <ArrayType id="_570" min="0" max="32u" type="_515" size="264" align="8"/>
  <ReferenceType id="_571" type="_352" size="64" align="64"/>
  <ReferenceType id="_572" type="_352c" size="64" align="64"/>
  <FundamentalType id="_515" name="char" size="8" align="8"/>
  <ReferenceType id="_581" type="_449" size="64" align="64"/>
  <ReferenceType id="_582" type="_449c" size="64" align="64"/>
  <ReferenceType id="_585" type="_489" size="64" align="64"/>
  <ReferenceType id="_586" type="_489c" size="64" align="64"/>
  <CvQualifiedType id="_515c" type="_515" const="1"/>
  <CvQualifiedType id="_399c" type="_399" const="1"/>
  <CvQualifiedType id="_449c" type="_449" const="1"/>
  <CvQualifiedType id="_241c" type="_241" const="1"/>
  <CvQualifiedType id="_352c" type="_352" const="1"/>
  <CvQualifiedType id="_133c" type="_133" const="1"/>
  <CvQualifiedType id="_235c" type="_235" const="1"/>
  <CvQualifiedType id="_132c" type="_132" const="1"/>
  <CvQualifiedType id="_60c" type="_60" const="1"/>
  <CvQualifiedType id="_87c" type="_87" const="1"/>
  <CvQualifiedType id="_27c" type="_27" const="1"/>
  <CvQualifiedType id="_489c" type="_489" const="1"/>
  <CvQualifiedType id="_269c" type="_269" const="1"/>
  <CvQualifiedType id="_83c" type="_83" const="1"/>
  <CvQualifiedType id="_332c" type="_332" const="1"/>
  <CvQualifiedType id="_258c" type="_258" const="1"/>
  <CvQualifiedType id="_229c" type="_229" const="1"/>
  <File id="f0" name="/usr/share/gccxml-0.9/GCC/4.9/gccxml_builtins.h"/>
  <File id="f1" name="/tmp/tmpDIjrv1.cpp"/>
  <File id="f2" name="/usr/include/stdint.h"/>
  <File id="f3" name="/tmp/./mncc.h"/>
  <CPP_DUMP name="functions"><![CDATA[INT16_C(c) c
INT32_C(c) c
INT64_C(c) c ## L
INT8_C(c) c
INTMAX_C(c) c ## L
UINT16_C(c) c
UINT32_C(c) c ## U
UINT64_C(c) c ## UL
UINT8_C(c) c
UINTMAX_C(c) c ## UL
__ASMNAME(cname) __ASMNAME2 (__USER_LABEL_PREFIX__, cname)
__ASMNAME2(prefix,cname) __STRING (prefix) cname
__CONCAT(x,y) x ## y
__GLIBC_PREREQ(maj,min) ((__GLIBC__ << 16) + __GLIBC_MINOR__ >= ((maj) << 16) + (min))
__GNUC_PREREQ(maj,min) ((__GNUC__ << 16) + __GNUC_MINOR__ >= ((maj) << 16) + (min))
__LDBL_REDIR(name,proto) name proto
__LDBL_REDIR1(name,proto,alias) name proto
__LDBL_REDIR1_NTH(name,proto,alias) name proto __THROW
__LDBL_REDIR_NTH(name,proto) name proto __THROW
__NTH(fct) __LEAF_ATTR fct throw ()
__P(args) args
__PMT(args) args
__REDIRECT(name,proto,alias) name proto __asm__ (__ASMNAME (#alias))
