<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

  <Enumeration id="_332" name="gsm48_bcap_parity" context="_1" location="f3:33" file="f3" line="33" artificial="1" size="32" align="32">
    <EnumValue name="GSM48_BCAP_PAR_ODD" init="0"/>
    <EnumValue name="GSM48_BCAP_PAR_EVEN" init="2"/>
    <EnumValue name="GSM48_BCAP_PAR_NONE" init="3"/>
    <EnumValue name="GSM48_BCAP_PAR_ZERO" init="4"/>
    <EnumValue name="GSM48_BCAP_PAR_ONE" init="5"/>
  </Enumeration>
  <Variable id="_333" name="cpp_sym_MNCC_REL_REQ" type="_93c" init="272" context="_1" location="f1:39" file="f1" line="39" static="1"/>
  <Variable id="_334" name="cpp_sym_MNCC_F_REDIRECTING" type="_93c" init="8" context="_1" location="f1:74" file="f1" line="74" static="1"/>
  <Variable id="_335" name="cpp_sym_GSM_TCH_FRAME_AMR" type="_93c" init="771" context="_1" location="f1:18" file="f1" line="18" static="1"/>
  <Function id="_336" name="__builtin_cosf" returns="_365" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_365" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_337" name="__builtin_cosh" returns="_362" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_362" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_338" name="__builtin_cosl" returns="_366" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_366" location="f0:44" file="f0" line="44"/>
  </Function>
  <Variable id="_339" name="cpp_sym_INT8_MAX" type="_93c" init="127" context="_1" location="f1:84" file="f1" line="84" static="1"/>
  <Variable id="_340" name="cpp_sym__DEFAULT_SOURCE" type="_93c" init="1" context="_1" location="f1:92" file="f1" line="92" static="1"/>
  <Variable id="_341" name="cpp_sym_INT_FAST8_MIN" type="_93c" init="-0x00000000000000080" context="_1" location="f1:140" file="f1" line="140" static="1"/>
  <Variable id="_342" name="cpp_sym___USE_FORTIFY_LEVEL" type="_93c" init="2" context="_1" location="f1:102" file="f1" line="102" static="1"/>
  <Function id="_343" name="__builtin_isgreater" returns="_367" context="_1" location="f0:137" file="f0" line="137" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Variable id="_344" name="cpp_sym_INT_LEAST8_MAX" type="_93c" init="127" context="_1" location="f1:2" file="f1" line="2" static="1"/>
  <Variable id="_345" name="cpp_sym_MNCC_CALL_CONF_IND" type="_93c" init="263" context="_1" location="f1:79" file="f1" line="79" static="1"/>
  <Struct id="_346" name="gsm_mncc_number" context="_1" mangled="15gsm_mncc_number" demangled="gsm_mncc_number" location="f3:96" file="f3" line="96" artificial="1" size="416" align="32" members="_492 _493 _494 _495 _496 _497 _498 _499 _500 " bases=""/>
  <Function id="_347" name="__builtin_bswap32" returns="_147" context="_1" location="f0:157" file="f0" line="157" extern="1">
    <Argument name="_data" type="_147" location="f0:157" file="f0" line="157"/>
  </Function>
  <Variable id="_348" name="cpp_sym_INT8_MIN" type="_93c" init="-0x00000000000000080" context="_1" location="f1:94" file="f1" line="94" static="1"/>
  <Typedef id="_349" name="uint_least8_t" type="_271" context="_1" location="f2:76" file="f2" line="76"/>
  <Variable id="_350" name="cpp_sym_MNCC_F_PROGRESS" type="_93c" init="128" context="_1" location="f1:59" file="f1" line="59" static="1"/>
  <Variable id="_351" name="cpp_sym___GNU_LIBRARY__" type="_93c" init="6" context="_1" location="f1:9" file="f1" line="9" static="1"/>
  <Function id="_352" name="__builtin_sinf" returns="_365" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_365" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_353" name="__builtin_sinh" returns="_362" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_362" location="f0:77" file="f0" line="77"/>
  </Function>
  <Function id="_354" name="__builtin_sinl" returns="_366" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_366" location="f0:80" file="f0" line="80"/>
  </Function>
  <Typedef id="_355" name="uint64_t" type="_9" context="_1" location="f2:55" file="f2" line="55"/>
  <Function id="_356" name="__builtin_csin" returns="_378" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_378" location="f0:115" file="f0" line="115"/>
  </Function>
  <Variable id="_357" name="cpp_sym_INT_LEAST8_MIN" type="_93c" init="-0x00000000000000080" context="_1" location="f1:44" file="f1" line="44" static="1"/>
  <Variable id="_358" name="cpp_sym__POSIX_SOURCE" type="_93c" init="1" context="_1" location="f1:36" file="f1" line="36" static="1"/>
  <Variable id="_359" name="cpp_sym_UINT_LEAST32_MAX" type="_147c" init="4294967295u" context="_1" location="f1:52" file="f1" line="52" static="1"/>
  <Variable id="_360" name="cpp_sym_INTMAX_MAX" type="_48c" init="9223372036854775807l" context="_1" location="f1:34" file="f1" line="34" static="1"/>
  <Variable id="_361" name="cpp_sym_GSM_TCHH_FRAME" type="_93c" init="770" context="_1" location="f1:5" file="f1" line="5" static="1"/>
  <FundamentalType id="_362" name="double" size="64" align="64"/>
  <PointerType id="_363" type="_501c" size="64" align="64"/>
  <CvQualifiedType id="_93c" type="_93" const="1"/>
  <FundamentalType id="_365" name="float" size="32" align="32"/>
  <FundamentalType id="_366" name="long double" size="128" align="128"/>
  <FundamentalType id="_367" name="bool" size="8" align="8"/>
  <FundamentalType id="_368" name="long long int" size="64" align="64"/>
  <FundamentalType id="_369" name="complex float" size="64" align="32"/>
  <FundamentalType id="_370" name="complex long double" size="256" align="128"/>
  <CvQualifiedType id="_48c" type="_48" const="1"/>
  <Field id="_372" name="dtmf" type="_93" offset="0" context="_27" access="public" location="f3:136" file="f3" line="136"/>
  <Field id="_373" name="pcp" type="_93" offset="32" context="_27" access="public" location="f3:137" file="f3" line="137"/>
  <Destructor id="_374" name="gsm_mncc_cccap" artificial="1" throw="" context="_27" access="public" mangled="_ZN14gsm_mncc_cccapD1Ev *INTERNAL* " demangled="gsm_mncc_cccap::~gsm_mncc_cccap()" location="f3:135" file="f3" line="135" endline="135" inline="1">
  </Destructor>
  <OperatorMethod id="_375" name="=" returns="_503" artificial="1" throw="" context="_27" access="public" mangled="_ZN14gsm_mncc_cccapaSERKS_" demangled="gsm_mncc_cccap::operator=(gsm_mncc_cccap const&amp;)" location="f3:135" file="f3" line="135" endline="135" inline="1">
    <Argument type="_504" location="f3:135" file="f3" line="135"/>
  </OperatorMethod>
  <Constructor id="_376" name="gsm_mncc_cccap" artificial="1" throw="" context="_27" access="public" mangled="_ZN14gsm_mncc_cccapC1ERKS_ *INTERNAL* " demangled="gsm_mncc_cccap::gsm_mncc_cccap(gsm_mncc_cccap const&amp;)" location="f3:135" file="f3" line="135" endline="135" inline="1">
    <Argument type="_504" location="f3:135" file="f3" line="135"/>
  </Constructor>
  <Constructor id="_377" name="gsm_mncc_cccap" artificial="1" throw="" context="_27" access="public" mangled="_ZN14gsm_mncc_cccapC1Ev *INTERNAL* " demangled="gsm_mncc_cccap::gsm_mncc_cccap()" location="f3:135" file="f3" line="135" inline="1"/>
  <FundamentalType id="_378" name="complex double" size="128" align="64"/>
  <Field id="_379" name="len" type="_93" offset="0" context="_60" access="public" location="f3:126" file="f3" line="126"/>
  <Field id="_380" name="info" type="_505" offset="32" context="_60" access="public" location="f3:127" file="f3" line="127"/>
  <Destructor id="_381" name="gsm_mncc_facility" artificial="1" throw="" context="_60" access="public" mangled="_ZN17gsm_mncc_facilityD1Ev *INTERNAL* " demangled="gsm_mncc_facility::~gsm_mncc_facility()" location="f3:125" file="f3" line="125" endline="125" inline="1">
  </Destructor>
  <OperatorMethod id="_382" name="=" returns="_506" artificial="1" throw="" context="_60" access="public" mangled="_ZN17gsm_mncc_facilityaSERKS_" demangled="gsm_mncc_facility::operator=(gsm_mncc_facility const&amp;)" location="f3:125" file="f3" line="125" endline="125" inline="1">
    <Argument type="_507" location="f3:125" file="f3" line="125"/>
  </OperatorMethod>
  <Constructor id="_383" name="gsm_mncc_facility" artificial="1" throw="" context="_60" access="public" mangled="_ZN17gsm_mncc_facilityC1ERKS_ *INTERNAL* " demangled="gsm_mncc_facility::gsm_mncc_facility(gsm_mncc_facility const&amp;)" location="f3:125" file="f3" line="125" endline="125" inline="1">
    <Argument type="_507" location="f3:125" file="f3" line="125"/>
  </Constructor>
  <Constructor id="_384" name="gsm_mncc_facility" artificial="1" throw="" context="_60" access="public" mangled="_ZN17gsm_mncc_facilityC1Ev *INTERNAL* " demangled="gsm_mncc_facility::gsm_mncc_facility()" location="f3:125" file="f3" line="125" inline="1"/>
  <CvQualifiedType id="_9c" type="_9" const="1"/>
  <Field id="_386" name="msg_type" type="_148" offset="0" context="_83" access="public" location="f3:265" file="f3" line="265"/>
  <Field id="_387" name="callref" type="_148" offset="32" context="_83" access="public" location="f3:266" file="f3" line="266"/>
  <Field id="_388" name="data" type="_508" offset="64" context="_83" access="public" location="f3:267" file="f3" line="267"/>
  <Destructor id="_389" name="gsm_data_frame" artificial="1" throw="" context="_83" access="public" mangled="_ZN14gsm_data_frameD1Ev *INTERNAL* " demangled="gsm_data_frame::~gsm_data_frame()" location="f3:264" file="f3" line="264" endline="264" inline="1">
  </Destructor>
  <OperatorMethod id="_390" name="=" returns="_509" artificial="1" throw="" context="_83" access="public" mangled="_ZN14gsm_data_frameaSERKS_" demangled="gsm_data_frame::operator=(gsm_data_frame const&amp;)" location="f3:264" file="f3" line="264" endline="264" inline="1">
    <Argument type="_510" location="f3:264" file="f3" line="264"/>
  </OperatorMethod>
  <Constructor id="_391" name="gsm_data_frame" artificial="1" throw="" context="_83" access="public" mangled="_ZN14gsm_data_frameC1ERKS_ *INTERNAL* " demangled="gsm_data_frame::gsm_data_frame(gsm_data_frame const&amp;)" location="f3:264" file="f3" line="264" endline="264" inline="1">
    <Argument type="_510" location="f3:264" file="f3" line="264"/>
  </Constructor>
  <Constructor id="_392" name="gsm_data_frame" artificial="1" throw="" context="_83" access="public" mangled="_ZN14gsm_data_frameC1Ev *INTERNAL* " demangled="gsm_data_frame::gsm_data_frame()" location="f3:264" file="f3" line="264" inline="1"/>
  <FundamentalType id="_393" name="void" align="8"/>
  <PointerType id="_394" type="_393" size="64" align="64"/>
  <Field id="_395" name="len" type="_93" offset="0" context="_87" access="public" location="f3:131" file="f3" line="131"/>
  <Field id="_396" name="info" type="_505" offset="32" context="_87" access="public" location="f3:132" file="f3" line="132"/>
  <Destructor id="_397" name="gsm_mncc_ssversion" artificial="1" throw="" context="_87" access="public" mangled="_ZN18gsm_mncc_ssversionD1Ev *INTERNAL* " demangled="gsm_mncc_ssversion::~gsm_mncc_ssversion()" location="f3:130" file="f3" line="130" endline="130" inline="1">
  </Destructor>
  <OperatorMethod id="_398" name="=" returns="_511" artificial="1" throw="" context="_87" access="public" mangled="_ZN18gsm_mncc_ssversionaSERKS_" demangled="gsm_mncc_ssversion::operator=(gsm_mncc_ssversion const&amp;)" location="f3:130" file="f3" line="130" endline="130" inline="1">
    <Argument type="_512" location="f3:130" file="f3" line="130"/>
  </OperatorMethod>
  <Constructor id="_399" name="gsm_mncc_ssversion" artificial="1" throw="" context="_87" access="public" mangled="_ZN18gsm_mncc_ssversionC1ERKS_ *INTERNAL* " demangled="gsm_mncc_ssversion::gsm_mncc_ssversion(gsm_mncc_ssversion const&amp;)" location="f3:130" file="f3" line="130" endline="130" inline="1">
    <Argument type="_512" location="f3:130" file="f3" line="130"/>
  </Constructor>
  <Constructor id="_400" name="gsm_mncc_ssversion" artificial="1" throw="" context="_87" access="public" mangled="_ZN18gsm_mncc_ssversionC1Ev *INTERNAL* " demangled="gsm_mncc_ssversion::gsm_mncc_ssversion()" location="f3:130" file="f3" line="130" inline="1"/>
  <PointerType id="_401" type="_393c" size="64" align="64"/>
  <PointerType id="_402" type="_93" size="64" align="64"/>
  <CvQualifiedType id="_147c" type="_147" const="1"/>
  <Field id="_404" name="coding" type="_93" offset="0" context="_132" access="public" location="f3:120" file="f3" line="120"/>
  <Field id="_405" name="location" type="_93" offset="32" context="_132" access="public" location="f3:121" file="f3" line="121"/>
  <Field id="_406" name="descr" type="_93" offset="64" context="_132" access="public" location="f3:122" file="f3" line="122"/>
  <Destructor id="_407" name="gsm_mncc_progress" artificial="1" throw="" context="_132" access="public" mangled="_ZN17gsm_mncc_progressD1Ev *INTERNAL* " demangled="gsm_mncc_progress::~gsm_mncc_progress()" location="f3:119" file="f3" line="119" endline="119" inline="1">
  </Destructor>
  <OperatorMethod id="_408" name="=" returns="_514" artificial="1" throw="" context="_132" access="public" mangled="_ZN17gsm_mncc_progressaSERKS_" demangled="gsm_mncc_progress::operator=(gsm_mncc_progress const&amp;)" location="f3:119" file="f3" line="119" endline="119" inline="1">
    <Argument type="_515" location="f3:119" file="f3" line="119"/>
  </OperatorMethod>
  <Constructor id="_409" name="gsm_mncc_progress" artificial="1" throw="" context="_132" access="public" mangled="_ZN17gsm_mncc_progressC1ERKS_ *INTERNAL* " demangled="gsm_mncc_progress::gsm_mncc_progress(gsm_mncc_progress const&amp;)" location="f3:119" file="f3" line="119" endline="119" inline="1">
    <Argument type="_515" location="f3:119" file="f3" line="119"/>
  </Constructor>
  <Constructor id="_410" name="gsm_mncc_progress" artificial="1" throw="" context="_132" access="public" mangled="_ZN17gsm_mncc_progressC1Ev *INTERNAL* " demangled="gsm_mncc_progress::gsm_mncc_progress()" location="f3:119" file="f3" line="119" inline="1"/>
  <Field id="_411" name="location" type="_93" offset="0" context="_133" access="public" location="f3:105" file="f3" line="105"/>
  <Field id="_412" name="coding" type="_93" offset="32" context="_133" access="public" location="f3:106" file="f3" line="106"/>
  <Field id="_413" name="rec" type="_93" offset="64" context="_133" access="public" location="f3:107" file="f3" line="107"/>
  <Field id="_414" name="rec_val" type="_93" offset="96" context="_133" access="public" location="f3:108" file="f3" line="108"/>
  <Field id="_415" name="value" type="_93" offset="128" context="_133" access="public" location="f3:109" file="f3" line="109"/>
  <Field id="_416" name="diag_len" type="_93" offset="160" context="_133" access="public" location="f3:110" file="f3" line="110"/>
  <Field id="_417" name="diag" type="_516" offset="192" context="_133" access="public" location="f3:111" file="f3" line="111"/>
  <Destructor id="_418" name="gsm_mncc_cause" artificial="1" throw="" context="_133" access="public" mangled="_ZN14gsm_mncc_causeD1Ev *INTERNAL* " demangled="gsm_mncc_cause::~gsm_mncc_cause()" location="f3:104" file="f3" line="104" endline="104" inline="1">
  </Destructor>
  <OperatorMethod id="_419" name="=" returns="_517" artificial="1" throw="" context="_133" access="public" mangled="_ZN14gsm_mncc_causeaSERKS_" demangled="gsm_mncc_cause::operator=(gsm_mncc_cause const&amp;)" location="f3:104" file="f3" line="104" endline="104" inline="1">
    <Argument type="_518" location="f3:104" file="f3" line="104"/>
  </OperatorMethod>
  <Constructor id="_420" name="gsm_mncc_cause" artificial="1" throw="" context="_133" access="public" mangled="_ZN14gsm_mncc_causeC1ERKS_ *INTERNAL* " demangled="gsm_mncc_cause::gsm_mncc_cause(gsm_mncc_cause const&amp;)" location="f3:104" file="f3" line="104" endline="104" inline="1">
    <Argument type="_518" location="f3:104" file="f3" line="104"/>
  </Constructor>
  <Constructor id="_421" name="gsm_mncc_cause" artificial="1" throw="" context="_133" access="public" mangled="_ZN14gsm_mncc_causeC1Ev *INTERNAL* " demangled="gsm_mncc_cause::gsm_mncc_cause()" location="f3:104" file="f3" line="104" inline="1"/>
  <PointerType id="_422" type="_365" size="64" align="64"/>
  <PointerType id="_423" type="_366" size="64" align="64"/>
  <Field id="_424" name="proto" type="_93" offset="0" context="_231" access="public" location="f3:115" file="f3" line="115"/>
  <Field id="_425" name="info" type="_519" offset="32" context="_231" access="public" location="f3:116" file="f3" line="116"/>
  <Destructor id="_426" name="gsm_mncc_useruser" artificial="1" throw="" context="_231" access="public" mangled="_ZN17gsm_mncc_useruserD1Ev *INTERNAL* " demangled="gsm_mncc_useruser::~gsm_mncc_useruser()" location="f3:114" file="f3" line="114" endline="114" inline="1">
  </Destructor>
  <OperatorMethod id="_427" name="=" returns="_520" artificial="1" throw="" context="_231" access="public" mangled="_ZN17gsm_mncc_useruseraSERKS_" demangled="gsm_mncc_useruser::operator=(gsm_mncc_useruser const&amp;)" location="f3:114" file="f3" line="114" endline="114" inline="1">
    <Argument type="_521" location="f3:114" file="f3" line="114"/>
  </OperatorMethod>
  <Constructor id="_428" name="gsm_mncc_useruser" artificial="1" throw="" context="_231" access="public" mangled="_ZN17gsm_mncc_useruserC1ERKS_ *INTERNAL* " demangled="gsm_mncc_useruser::gsm_mncc_useruser(gsm_mncc_useruser const&amp;)" location="f3:114" file="f3" line="114" endline="114" inline="1">
    <Argument type="_521" location="f3:114" file="f3" line="114"/>
  </Constructor>
  <Constructor id="_429" name="gsm_mncc_useruser" artificial="1" throw="" context="_231" access="public" mangled="_ZN17gsm_mncc_useruserC1Ev *INTERNAL* " demangled="gsm_mncc_useruser::gsm_mncc_useruser()" location="f3:114" file="f3" line="114" inline="1"/>
  <Field id="_430" name="transfer" type="_93" offset="0" context="_237" access="public" location="f3:76" file="f3" line="76"/>
  <Field id="_431" name="mode" type="_93" offset="32" context="_237" access="public" location="f3:77" file="f3" line="77"/>
  <Field id="_432" name="coding" type="_93" offset="64" context="_237" access="public" location="f3:78" file="f3" line="78"/>
  <Field id="_433" name="radio" type="_93" offset="96" context="_237" access="public" location="f3:79" file="f3" line="79"/>
  <Field id="_434" name="speech_ctm" type="_93" offset="128" context="_237" access="public" location="f3:80" file="f3" line="80"/>
  <Field id="_435" name="speech_ver" type="_522" offset="160" context="_237" access="public" location="f3:81" file="f3" line="81"/>
  <Field id="_436" name="data" type="_437" offset="416" context="_237" access="public" location="f3:93" file="f3" line="93"/>
  <Struct id="_437" context="_237" access="public" mangled="N19gsm_mncc_bearer_cap3._0E" demangled="gsm_mncc_bearer_cap::._0" location="f3:82" file="f3" line="82" artificial="1" size="320" align="32" members="_523 _524 _525 _526 _527 _528 _529 _530 _531 _532 _533 _534 _535 _536 " bases=""/>
  <Destructor id="_438" name="gsm_mncc_bearer_cap" artificial="1" throw="" context="_237" access="public" mangled="_ZN19gsm_mncc_bearer_capD1Ev *INTERNAL* " demangled="gsm_mncc_bearer_cap::~gsm_mncc_bearer_cap()" location="f3:75" file="f3" line="75" endline="75" inline="1">
  </Destructor>
  <OperatorMethod id="_439" name="=" returns="_537" artificial="1" throw="" context="_237" access="public" mangled="_ZN19gsm_mncc_bearer_capaSERKS_" demangled="gsm_mncc_bearer_cap::operator=(gsm_mncc_bearer_cap const&amp;)" location="f3:75" file="f3" line="75" endline="75" inline="1">
    <Argument type="_538" location="f3:75" file="f3" line="75"/>
  </OperatorMethod>
  <Constructor id="_440" name="gsm_mncc_bearer_cap" artificial="1" throw="" context="_237" access="public" mangled="_ZN19gsm_mncc_bearer_capC1ERKS_ *INTERNAL* " demangled="gsm_mncc_bearer_cap::gsm_mncc_bearer_cap(gsm_mncc_bearer_cap const&amp;)" location="f3:75" file="f3" line="75" endline="75" inline="1">
    <Argument type="_538" location="f3:75" file="f3" line="75"/>
  </Constructor>
  <Constructor id="_441" name="gsm_mncc_bearer_cap" artificial="1" throw="" context="_237" access="public" mangled="_ZN19gsm_mncc_bearer_capC1Ev *INTERNAL* " demangled="gsm_mncc_bearer_cap::gsm_mncc_bearer_cap()" location="f3:75" file="f3" line="75" inline="1"/>
  <Field id="_442" name="msg_type" type="_148" offset="0" context="_253" access="public" location="f3:287" file="f3" line="287"/>
  <Field id="_443" name="callref" type="_148" offset="32" context="_253" access="public" location="f3:288" file="f3" line="288"/>
  <Field id="_444" name="ip" type="_148" offset="64" context="_253" access="public" location="f3:289" file="f3" line="289"/>
  <Field id="_445" name="port" type="_261" offset="96" context="_253" access="public" location="f3:290" file="f3" line="290"/>
  <Field id="_446" name="payload_type" type="_148" offset="128" context="_253" access="public" location="f3:291" file="f3" line="291"/>
  <Field id="_447" name="payload_msg_type" type="_148" offset="160" context="_253" access="public" location="f3:292" file="f3" line="292"/>
  <Destructor id="_448" name="gsm_mncc_rtp" artificial="1" throw="" context="_253" access="public" mangled="_ZN12gsm_mncc_rtpD1Ev *INTERNAL* " demangled="gsm_mncc_rtp::~gsm_mncc_rtp()" location="f3:286" file="f3" line="286" endline="286" inline="1">
  </Destructor>
  <OperatorMethod id="_449" name="=" returns="_539" artificial="1" throw="" context="_253" access="public" mangled="_ZN12gsm_mncc_rtpaSERKS_" demangled="gsm_mncc_rtp::operator=(gsm_mncc_rtp const&amp;)" location="f3:286" file="f3" line="286" endline="286" inline="1">
    <Argument type="_540" location="f3:286" file="f3" line="286"/>
  </OperatorMethod>
  <Constructor id="_450" name="gsm_mncc_rtp" artificial="1" throw="" context="_253" access="public" mangled="_ZN12gsm_mncc_rtpC1ERKS_ *INTERNAL* " demangled="gsm_mncc_rtp::gsm_mncc_rtp(gsm_mncc_rtp const&amp;)" location="f3:286" file="f3" line="286" endline="286" inline="1">
    <Argument type="_540" location="f3:286" file="f3" line="286"/>
  </Constructor>
  <Constructor id="_451" name="gsm_mncc_rtp" artificial="1" throw="" context="_253" access="public" mangled="_ZN12gsm_mncc_rtpC1Ev *INTERNAL* " demangled="gsm_mncc_rtp::gsm_mncc_rtp()" location="f3:286" file="f3" line="286" inline="1"/>
  <Field id="_452" name="msg_type" type="_148" offset="0" context="_264" access="public" location="f3:229" file="f3" line="229"/>
  <Field id="_453" name="callref" type="_148" offset="32" context="_264" access="public" location="f3:230" file="f3" line="230"/>
  <Field id="_454" name="fields" type="_148" offset="64" context="_264" access="public" location="f3:233" file="f3" line="233"/>
  <Field id="_455" name="bearer_cap" type="_237" offset="96" context="_264" access="public" location="f3:236" file="f3" line="236"/>
  <Field id="_456" name="called" type="_346" offset="832" context="_264" access="public" location="f3:237" file="f3" line="237"/>
  <Field id="_457" name="calling" type="_346" offset="1248" context="_264" access="public" location="f3:238" file="f3" line="238"/>
  <Field id="_458" name="redirecting" type="_346" offset="1664" context="_264" access="public" location="f3:239" file="f3" line="239"/>
  <Field id="_459" name="connected" type="_346" offset="2080" context="_264" access="public" location="f3:240" file="f3" line="240"/>
  <Field id="_460" name="cause" type="_133" offset="2496" context="_264" access="public" location="f3:241" file="f3" line="241"/>
  <Field id="_461" name="progress" type="_132" offset="2944" context="_264" access="public" location="f3:242" file="f3" line="242"/>
  <Field id="_462" name="useruser" type="_231" offset="3040" context="_264" access="public" location="f3:243" file="f3" line="243"/>
  <Field id="_463" name="facility" type="_60" offset="4128" context="_264" access="public" location="f3:244" file="f3" line="244"/>
  <Field id="_464" name="cccap" type="_27" offset="5184" context="_264" access="public" location="f3:245" file="f3" line="245"/>
  <Field id="_465" name="ssversion" type="_87" offset="5248" context="_264" access="public" location="f3:246" file="f3" line="246"/>
  <Field id="_466" name="clir" type="_475" offset="6304" context="_264" access="public" location="f3:250" file="f3" line="250"/>
  <Field id="_467" name="signal" type="_93" offset="6368" context="_264" access="public" location="f3:251" file="f3" line="251"/>
  <Field id="_468" name="keypad" type="_93" offset="6400" context="_264" access="public" location="f3:254" file="f3" line="254"/>
  <Field id="_469" name="more" type="_93" offset="6432" context="_264" access="public" location="f3:255" file="f3" line="255"/>
  <Field id="_470" name="notify" type="_93" offset="6464" context="_264" access="public" location="f3:256" file="f3" line="256"/>
  <Field id="_471" name="emergency" type="_93" offset="6496" context="_264" access="public" location="f3:257" file="f3" line="257"/>
  <Field id="_472" name="imsi" type="_541" offset="6528" context="_264" access="public" location="f3:258" file="f3" line="258"/>
  <Field id="_473" name="lchan_type" type="_271" offset="6656" context="_264" access="public" location="f3:260" file="f3" line="260"/>
  <Field id="_474" name="lchan_mode" type="_271" offset="6664" context="_264" access="public" location="f3:261" file="f3" line="261"/>
  <Struct id="_475" context="_264" access="public" mangled="N8gsm_mncc3._2E" demangled="gsm_mncc::._2" location="f3:247" file="f3" line="247" artificial="1" size="64" align="32" members="_542 _543 _544 _545 _546 _547 " bases=""/>
  <Destructor id="_476" name="gsm_mncc" artificial="1" throw="" context="_264" access="public" mangled="_ZN8gsm_mnccD1Ev *INTERNAL* " demangled="gsm_mncc::~gsm_mncc()" location="f3:227" file="f3" line="227" endline="227" inline="1">
  </Destructor>
  <OperatorMethod id="_477" name="=" returns="_548" artificial="1" throw="" context="_264" access="public" mangled="_ZN8gsm_mnccaSERKS_" demangled="gsm_mncc::operator=(gsm_mncc const&amp;)" location="f3:227" file="f3" line="227" endline="227" inline="1">
    <Argument type="_549" location="f3:227" file="f3" line="227"/>
  </OperatorMethod>
  <Constructor id="_478" name="gsm_mncc" artificial="1" throw="" context="_264" access="public" mangled="_ZN8gsm_mnccC1ERKS_ *INTERNAL* " demangled="gsm_mncc::gsm_mncc(gsm_mncc const&amp;)" location="f3:227" file="f3" line="227" endline="227" inline="1">
    <Argument type="_549" location="f3:227" file="f3" line="227"/>
  </Constructor>
  <Constructor id="_479" name="gsm_mncc" artificial="1" throw="" context="_264" access="public" mangled="_ZN8gsm_mnccC1Ev *INTERNAL* " demangled="gsm_mncc::gsm_mncc()" location="f3:227" file="f3" line="227" inline="1"/>
  <Field id="_480" name="msg_type" type="_148" offset="0" context="_326" access="public" location="f3:272" file="f3" line="272"/>
  <Field id="_481" name="version" type="_148" offset="32" context="_326" access="public" location="f3:273" file="f3" line="273"/>
  <Field id="_482" name="mncc_size" type="_148" offset="64" context="_326" access="public" location="f3:276" file="f3" line="276"/>
  <Field id="_483" name="data_frame_size" type="_148" offset="96" context="_326" access="public" location="f3:277" file="f3" line="277"/>
  <Field id="_484" name="called_offset" type="_148" offset="128" context="_326" access="public" location="f3:280" file="f3" line="280"/>
  <Field id="_485" name="signal_offset" type="_148" offset="160" context="_326" access="public" location="f3:281" file="f3" line="281"/>
  <Field id="_486" name="emergency_offset" type="_148" offset="192" context="_326" access="public" location="f3:282" file="f3" line="282"/>
  <Field id="_487" name="lchan_type_offset" type="_148" offset="224" context="_326" access="public" location="f3:283" file="f3" line="283"/>
  <Destructor id="_488" name="gsm_mncc_hello" artificial="1" throw="" context="_326" access="public" mangled="_ZN14gsm_mncc_helloD1Ev *INTERNAL* " demangled="gsm_mncc_hello::~gsm_mncc_hello()" location="f3:271" file="f3" line="271" endline="271" inline="1">
  </Destructor>
  <OperatorMethod id="_489" name="=" returns="_550" artificial="1" throw="" context="_326" access="public" mangled="_ZN14gsm_mncc_helloaSERKS_" demangled="gsm_mncc_hello::operator=(gsm_mncc_hello const&amp;)" location="f3:271" file="f3" line="271" endline="271" inline="1">
    <Argument type="_551" location="f3:271" file="f3" line="271"/>
  </OperatorMethod>
  <Constructor id="_490" name="gsm_mncc_hello" artificial="1" throw="" context="_326" access="public" mangled="_ZN14gsm_mncc_helloC1ERKS_ *INTERNAL* " demangled="gsm_mncc_hello::gsm_mncc_hello(gsm_mncc_hello const&amp;)" location="f3:271" file="f3" line="271" endline="271" inline="1">
    <Argument type="_551" location="f3:271" file="f3" line="271"/>
  </Constructor>
  <Constructor id="_491" name="gsm_mncc_hello" artificial="1" throw="" context="_326" access="public" mangled="_ZN14gsm_mncc_helloC1Ev *INTERNAL* " demangled="gsm_mncc_hello::gsm_mncc_hello()" location="f3:271" file="f3" line="271" inline="1"/>
  <Field id="_492" name="type" type="_93" offset="0" context="_346" access="public" location="f3:97" file="f3" line="97"/>
  <Field id="_493" name="plan" type="_93" offset="32" context="_346" access="public" location="f3:98" file="f3" line="98"/>
  <Field id="_494" name="present" type="_93" offset="64" context="_346" access="public" location="f3:99" file="f3" line="99"/>
  <Field id="_495" name="screen" type="_93" offset="96" context="_346" access="public" location="f3:100" file="f3" line="100"/>
  <Field id="_496" name="number" type="_552" offset="128" context="_346" access="public" location="f3:101" file="f3" line="101"/>
  <Destructor id="_497" name="gsm_mncc_number" artificial="1" throw="" context="_346" access="public" mangled="_ZN15gsm_mncc_numberD1Ev *INTERNAL* " demangled="gsm_mncc_number::~gsm_mncc_number()" location="f3:96" file="f3" line="96" endline="96" inline="1">
  </Destructor>
  <OperatorMethod id="_498" name="=" returns="_553" artificial="1" throw="" context="_346" access="public" mangled="_ZN15gsm_mncc_numberaSERKS_" demangled="gsm_mncc_number::operator=(gsm_mncc_number const&amp;)" location="f3:96" file="f3" line="96" endline="96" inline="1">
    <Argument type="_554" location="f3:96" file="f3" line="96"/>
  </OperatorMethod>
  <Constructor id="_499" name="gsm_mncc_number" artificial="1" throw="" context="_346" access="public" mangled="_ZN15gsm_mncc_numberC1ERKS_ *INTERNAL* " demangled="gsm_mncc_number::gsm_mncc_number(gsm_mncc_number const&amp;)" location="f3:96" file="f3" line="96" endline="96" inline="1">
    <Argument type="_554" location="f3:96" file="f3" line="96"/>
  </Constructor>
  <Constructor id="_500" name="gsm_mncc_number" artificial="1" throw="" context="_346" access="public" mangled="_ZN15gsm_mncc_numberC1Ev *INTERNAL* " demangled="gsm_mncc_number::gsm_mncc_number()" location="f3:96" file="f3" line="96" inline="1"/>
  <ReferenceType id="_503" type="_27" size="64" align="64"/>
  <ReferenceType id="_504" type="_27c" size="64" align="64"/>
  <ArrayType id="_505" min="0" max="127u" type="_501" size="1024" align="8"/>
  <ReferenceType id="_506" type="_60" size="64" align="64"/>
  <ReferenceType id="_507" type="_60c" size="64" align="64"/>
  <ArrayType id="_508" min="0" max="0xffffffffffffffffffffffffffffffffu" type="_271" size="0" align="8"/>
  <ReferenceType id="_509" type="_83" size="64" align="64"/>
  <ReferenceType id="_510" type="_83c" size="64" align="64"/>
  <ReferenceType id="_511" type="_87" size="64" align="64"/>
  <ReferenceType id="_512" type="_87c" size="64" align="64"/>
  <ReferenceType id="_514" type="_132" size="64" align="64"/>
  <ReferenceType id="_515" type="_132c" size="64" align="64"/>
  <ArrayType id="_516" min="0" max="31u" type="_501" size="256" align="8"/>
  <ReferenceType id="_517" type="_133" size="64" align="64"/>
  <ReferenceType id="_518" type="_133c" size="64" align="64"/>
  <ArrayType id="_519" min="0" max="128u" type="_501" size="1032" align="8"/>
  <ReferenceType id="_520" type="_231" size="64" align="64"/>
  <ReferenceType id="_521" type="_231c" size="64" align="64"/>
  <ArrayType id="_522" min="0" max="7u" type="_93" size="256" align="32"/>
  <Field id="_523" name="rate_adaption" type="_105" offset="0" context="_437" access="public" location="f3:83" file="f3" line="83"/>
  <Field id="_524" name="sig_access" type="_71" offset="32" context="_437" access="public" location="f3:84" file="f3" line="84"/>
  <Field id="_525" name="async" type="_93" offset="64" context="_437" access="public" location="f3:85" file="f3" line="85"/>
  <Field id="_526" name="nr_stop_bits" type="_93" offset="96" context="_437" access="public" location="f3:86" file="f3" line="86"/>
  <Field id="_527" name="nr_data_bits" type="_93" offset="128" context="_437" access="public" location="f3:87" file="f3" line="87"/>
  <Field id="_528" name="user_rate" type="_167" offset="160" context="_437" access="public" location="f3:88" file="f3" line="88"/>
  <Field id="_529" name="parity" type="_332" offset="192" context="_437" access="public" location="f3:89" file="f3" line="89"/>
  <Field id="_530" name="interm_rate" type="_298" offset="224" context="_437" access="public" location="f3:90" file="f3" line="90"/>
  <Field id="_531" name="transp" type="_141" offset="256" context="_437" access="public" location="f3:91" file="f3" line="91"/>
  <Field id="_532" name="modem_type" type="_153" offset="288" context="_437" access="public" location="f3:92" file="f3" line="92"/>
  <Destructor id="_533" name="._0" artificial="1" throw="" context="_437" access="public" mangled="_ZN19gsm_mncc_bearer_cap3._0D1Ev *INTERNAL* " demangled="gsm_mncc_bearer_cap::._0::~._0()" location="f3:82" file="f3" line="82" endline="82" inline="1">
  </Destructor>
  <OperatorMethod id="_534" name="=" returns="_562" artificial="1" throw="" context="_437" access="public" mangled="_ZN19gsm_mncc_bearer_cap3._0aSERKS0_" demangled="gsm_mncc_bearer_cap::._0::operator=(gsm_mncc_bearer_cap::._0 const&amp;)" location="f3:82" file="f3" line="82" endline="82" inline="1">
    <Argument type="_563" location="f3:82" file="f3" line="82"/>
  </OperatorMethod>
  <Constructor id="_535" artificial="1" throw="" context="_437" access="public" mangled="_ZN19gsm_mncc_bearer_cap3._0C1ERKS0_ *INTERNAL* " demangled="gsm_mncc_bearer_cap::._0::._0(gsm_mncc_bearer_cap::._0 const&amp;)" location="f3:82" file="f3" line="82" endline="82" inline="1">
    <Argument type="_563" location="f3:82" file="f3" line="82"/>
  </Constructor>
  <Constructor id="_536" artificial="1" throw="" context="_437" access="public" mangled="_ZN19gsm_mncc_bearer_cap3._0C1Ev *INTERNAL* " demangled="gsm_mncc_bearer_cap::._0::._0()" location="f3:82" file="f3" line="82" inline="1"/>
  <ReferenceType id="_537" type="_237" size="64" align="64"/>
  <ReferenceType id="_538" type="_237c" size="64" align="64"/>
  <ReferenceType id="_539" type="_253" size="64" align="64"/>
  <ReferenceType id="_540" type="_253c" size="64" align="64"/>
  <ArrayType id="_541" min="0" max="15u" type="_501" size="128" align="8"/>
  <Field id="_542" name="sup" type="_93" offset="0" context="_475" access="public" location="f3:248" file="f3" line="248"/>
  <Field id="_543" name="inv" type="_93" offset="32" context="_475" access="public" location="f3:249" file="f3" line="249"/>
  <Destructor id="_544" name="._2" artificial="1" throw="" context="_475" access="public" mangled="_ZN8gsm_mncc3._2D1Ev *INTERNAL* " demangled="gsm_mncc::._2::~._2()" location="f3:247" file="f3" line="247" endline="247" inline="1">
  </Destructor>
  <OperatorMethod id="_545" name="=" returns="_566" artificial="1" throw="" context="_475" access="public" mangled="_ZN8gsm_mncc3._2aSERKS0_" demangled="gsm_mncc::._2::operator=(gsm_mncc::._2 const&amp;)" location="f3:247" file="f3" line="247" endline="247" inline="1">
    <Argument type="_567" location="f3:247" file="f3" line="247"/>
  </OperatorMethod>
  <Constructor id="_546" artificial="1" throw="" context="_475" access="public" mangled="_ZN8gsm_mncc3._2C1ERKS0_ *INTERNAL* " demangled="gsm_mncc::._2::._2(gsm_mncc::._2 const&amp;)" location="f3:247" file="f3" line="247" endline="247" inline="1">
    <Argument type="_567" location="f3:247" file="f3" line="247"/>
  </Constructor>
  <Constructor id="_547" artificial="1" throw="" context="_475" access="public" mangled="_ZN8gsm_mncc3._2C1Ev *INTERNAL* " demangled="gsm_mncc::._2::._2()" location="f3:247" file="f3" line="247" inline="1"/>
  <ReferenceType id="_548" type="_264" size="64" align="64"/>
  <ReferenceType id="_549" type="_264c" size="64" align="64"/>
  <ReferenceType id="_550" type="_326" size="64" align="64"/>
  <ReferenceType id="_551" type="_326c" size="64" align="64"/>
  <ArrayType id="_552" min="0" max="32u" type="_501" size="264" align="8"/>
  <ReferenceType id="_553" type="_346" size="64" align="64"/>
  <ReferenceType id="_554" type="_346c" size="64" align="64"/>
  <FundamentalType id="_501" name="char" size="8" align="8"/>
  <ReferenceType id="_562" type="_437" size="64" align="64"/>
  <ReferenceType id="_563" type="_437c" size="64" align="64"/>
  <ReferenceType id="_566" type="_475" size="64" align="64"/>
  <ReferenceType id="_567" type="_475c" size="64" align="64"/>
  <CvQualifiedType id="_501c" type="_501" const="1"/>
  <CvQualifiedType id="_393c" type="_393" const="1"/>
  <CvQualifiedType id="_437c" type="_437" const="1"/>
  <CvQualifiedType id="_237c" type="_237" const="1"/>
  <CvQualifiedType id="_346c" type="_346" const="1"/>
  <CvQualifiedType id="_133c" type="_133" const="1"/>
  <CvQualifiedType id="_231c" type="_231" const="1"/>
  <CvQualifiedType id="_132c" type="_132" const="1"/>
  <CvQualifiedType id="_60c" type="_60" const="1"/>
  <CvQualifiedType id="_87c" type="_87" const="1"/>
  <CvQualifiedType id="_27c" type="_27" const="1"/>
  <CvQualifiedType id="_475c" type="_475" const="1"/>
  <CvQualifiedType id="_264c" type="_264" const="1"/>
  <CvQualifiedType id="_83c" type="_83" const="1"/>
  <CvQualifiedType id="_326c" type="_326" const="1"/>
  <CvQualifiedType id="_253c" type="_253" const="1"/>
  <File id="f0" name="/usr/share/gccxml-0.9/GCC/4.9/gccxml_builtins.h"/>
  <File id="f1" name="/tmp/tmpPCmJyP.cpp"/>
  <File id="f2" name="/usr/include/stdint.h"/>
  <File id="f3" name="/tmp/./mncc.h"/>
  <CPP_DUMP name="functions"><![CDATA[INT16_C(c) c
INT32_C(c) c
INT64_C(c) c ## L
INT8_C(c) c
INTMAX_C(c) c ## L
UINT16_C(c) c
UINT32_C(c) c ## U
UINT64_C(c) c ## UL
UINT8_C(c) c
UINTMAX_C(c) c ## UL
__ASMNAME(cname) __ASMNAME2 (__USER_LABEL_PREFIX__, cname)
__ASMNAME2(prefix,cname) __STRING (prefix) cname
__CONCAT(x,y) x ## y
__GLIBC_PREREQ(maj,min) ((__GLIBC__ << 16) + __GLIBC_MINOR__ >= ((maj) << 16) + (min))
__GNUC_PREREQ(maj,min) ((__GNUC__ << 16) + __GNUC_MINOR__ >= ((maj) << 16) + (min))
__LDBL_REDIR(name,proto) name proto
__LDBL_REDIR1(name,proto,alias) name proto
__LDBL_REDIR1_NTH(name,proto,alias) name proto __THROW
__LDBL_REDIR_NTH(name,proto) name proto __THROW
__NTH(fct) __LEAF_ATTR fct throw ()
__P(args) args
__PMT(args) args
__REDIRECT(name,proto,alias) name proto __asm__ (__ASMNAME (#alias))
__REDIRECT_LDBL(name,proto,alias) __REDIRECT (name, proto, alias)
