<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

  <Enumeration id="_333" name="gsm48_bcap_parity" context="_1" location="f3:39" file="f3" line="39" artificial="1" size="32" align="32">
    <EnumValue name="GSM48_BCAP_PAR_ODD" init="0"/>
    <EnumValue name="GSM48_BCAP_PAR_EVEN" init="2"/>
    <EnumValue name="GSM48_BCAP_PAR_NONE" init="3"/>
    <EnumValue name="GSM48_BCAP_PAR_ZERO" init="4"/>
    <EnumValue name="GSM48_BCAP_PAR_ONE" init="5"/>
  </Enumeration>
  <Variable id="_334" name="cpp_sym_MNCC_REL_REQ" type="_93c" init="272" context="_1" location="f1:40" file="f1" line="40" static="1"/>
  <Variable id="_335" name="cpp_sym_MNCC_F_REDIRECTING" type="_93c" init="8" context="_1" location="f1:75" file="f1" line="75" static="1"/>
  <Variable id="_336" name="cpp_sym_GSM_TCH_FRAME_AMR" type="_93c" init="771" context="_1" location="f1:18" file="f1" line="18" static="1"/>
  <Function id="_337" name="__builtin_cosf" returns="_366" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_366" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_338" name="__builtin_cosh" returns="_363" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_363" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_339" name="__builtin_cosl" returns="_367" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_367" location="f0:44" file="f0" line="44"/>
  </Function>
  <Variable id="_340" name="cpp_sym_INT8_MAX" type="_93c" init="127" context="_1" location="f1:85" file="f1" line="85" static="1"/>
  <Variable id="_341" name="cpp_sym__DEFAULT_SOURCE" type="_93c" init="1" context="_1" location="f1:93" file="f1" line="93" static="1"/>
  <Variable id="_342" name="cpp_sym_INT_FAST8_MIN" type="_93c" init="-0x00000000000000080" context="_1" location="f1:141" file="f1" line="141" static="1"/>
  <Variable id="_343" name="cpp_sym___USE_FORTIFY_LEVEL" type="_93c" init="2" context="_1" location="f1:103" file="f1" line="103" static="1"/>
  <Function id="_344" name="__builtin_isgreater" returns="_368" context="_1" location="f0:137" file="f0" line="137" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Variable id="_345" name="cpp_sym_INT_LEAST8_MAX" type="_93c" init="127" context="_1" location="f1:2" file="f1" line="2" static="1"/>
  <Variable id="_346" name="cpp_sym_MNCC_CALL_CONF_IND" type="_93c" init="263" context="_1" location="f1:80" file="f1" line="80" static="1"/>
  <Struct id="_347" name="gsm_mncc_number" context="_1" mangled="15gsm_mncc_number" demangled="gsm_mncc_number" location="f3:102" file="f3" line="102" artificial="1" size="416" align="32" members="_499 _500 _501 _502 _503 _504 _505 _506 _507 " bases=""/>
  <Function id="_348" name="__builtin_bswap32" returns="_147" context="_1" location="f0:157" file="f0" line="157" extern="1">
    <Argument name="_data" type="_147" location="f0:157" file="f0" line="157"/>
  </Function>
  <Variable id="_349" name="cpp_sym_INT8_MIN" type="_93c" init="-0x00000000000000080" context="_1" location="f1:95" file="f1" line="95" static="1"/>
  <Typedef id="_350" name="uint_least8_t" type="_272" context="_1" location="f2:76" file="f2" line="76"/>
  <Variable id="_351" name="cpp_sym_MNCC_F_PROGRESS" type="_93c" init="128" context="_1" location="f1:60" file="f1" line="60" static="1"/>
  <Variable id="_352" name="cpp_sym___GNU_LIBRARY__" type="_93c" init="6" context="_1" location="f1:9" file="f1" line="9" static="1"/>
  <Function id="_353" name="__builtin_sinf" returns="_366" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_366" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_354" name="__builtin_sinh" returns="_363" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_363" location="f0:77" file="f0" line="77"/>
  </Function>
  <Function id="_355" name="__builtin_sinl" returns="_367" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_367" location="f0:80" file="f0" line="80"/>
  </Function>
  <Typedef id="_356" name="uint64_t" type="_9" context="_1" location="f2:55" file="f2" line="55"/>
  <Function id="_357" name="__builtin_csin" returns="_379" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_379" location="f0:115" file="f0" line="115"/>
  </Function>
  <Variable id="_358" name="cpp_sym_INT_LEAST8_MIN" type="_93c" init="-0x00000000000000080" context="_1" location="f1:45" file="f1" line="45" static="1"/>
  <Variable id="_359" name="cpp_sym__POSIX_SOURCE" type="_93c" init="1" context="_1" location="f1:37" file="f1" line="37" static="1"/>
  <Variable id="_360" name="cpp_sym_UINT_LEAST32_MAX" type="_147c" init="4294967295u" context="_1" location="f1:53" file="f1" line="53" static="1"/>
  <Variable id="_361" name="cpp_sym_INTMAX_MAX" type="_48c" init="9223372036854775807l" context="_1" location="f1:35" file="f1" line="35" static="1"/>
  <Variable id="_362" name="cpp_sym_GSM_TCHH_FRAME" type="_93c" init="770" context="_1" location="f1:5" file="f1" line="5" static="1"/>
  <FundamentalType id="_363" name="double" size="64" align="64"/>
  <PointerType id="_364" type="_508c" size="64" align="64"/>
  <CvQualifiedType id="_93c" type="_93" const="1"/>
  <FundamentalType id="_366" name="float" size="32" align="32"/>
  <FundamentalType id="_367" name="long double" size="128" align="128"/>
  <FundamentalType id="_368" name="bool" size="8" align="8"/>
  <FundamentalType id="_369" name="long long int" size="64" align="64"/>
  <FundamentalType id="_370" name="complex float" size="64" align="32"/>
  <FundamentalType id="_371" name="complex long double" size="256" align="128"/>
  <CvQualifiedType id="_48c" type="_48" const="1"/>
  <Field id="_373" name="dtmf" type="_93" offset="0" context="_27" access="public" location="f3:142" file="f3" line="142"/>
  <Field id="_374" name="pcp" type="_93" offset="32" context="_27" access="public" location="f3:143" file="f3" line="143"/>
  <Destructor id="_375" name="gsm_mncc_cccap" artificial="1" throw="" context="_27" access="public" mangled="_ZN14gsm_mncc_cccapD1Ev *INTERNAL* " demangled="gsm_mncc_cccap::~gsm_mncc_cccap()" location="f3:141" file="f3" line="141" endline="141" inline="1">
  </Destructor>
  <OperatorMethod id="_376" name="=" returns="_510" artificial="1" throw="" context="_27" access="public" mangled="_ZN14gsm_mncc_cccapaSERKS_" demangled="gsm_mncc_cccap::operator=(gsm_mncc_cccap const&amp;)" location="f3:141" file="f3" line="141" endline="141" inline="1">
    <Argument type="_511" location="f3:141" file="f3" line="141"/>
  </OperatorMethod>
  <Constructor id="_377" name="gsm_mncc_cccap" artificial="1" throw="" context="_27" access="public" mangled="_ZN14gsm_mncc_cccapC1ERKS_ *INTERNAL* " demangled="gsm_mncc_cccap::gsm_mncc_cccap(gsm_mncc_cccap const&amp;)" location="f3:141" file="f3" line="141" endline="141" inline="1">
    <Argument type="_511" location="f3:141" file="f3" line="141"/>
  </Constructor>
  <Constructor id="_378" name="gsm_mncc_cccap" artificial="1" throw="" context="_27" access="public" mangled="_ZN14gsm_mncc_cccapC1Ev *INTERNAL* " demangled="gsm_mncc_cccap::gsm_mncc_cccap()" location="f3:141" file="f3" line="141" inline="1"/>
  <FundamentalType id="_379" name="complex double" size="128" align="64"/>
  <Field id="_380" name="len" type="_93" offset="0" context="_60" access="public" location="f3:132" file="f3" line="132"/>
  <Field id="_381" name="info" type="_512" offset="32" context="_60" access="public" location="f3:133" file="f3" line="133"/>
  <Destructor id="_382" name="gsm_mncc_facility" artificial="1" throw="" context="_60" access="public" mangled="_ZN17gsm_mncc_facilityD1Ev *INTERNAL* " demangled="gsm_mncc_facility::~gsm_mncc_facility()" location="f3:131" file="f3" line="131" endline="131" inline="1">
  </Destructor>
  <OperatorMethod id="_383" name="=" returns="_513" artificial="1" throw="" context="_60" access="public" mangled="_ZN17gsm_mncc_facilityaSERKS_" demangled="gsm_mncc_facility::operator=(gsm_mncc_facility const&amp;)" location="f3:131" file="f3" line="131" endline="131" inline="1">
    <Argument type="_514" location="f3:131" file="f3" line="131"/>
  </OperatorMethod>
  <Constructor id="_384" name="gsm_mncc_facility" artificial="1" throw="" context="_60" access="public" mangled="_ZN17gsm_mncc_facilityC1ERKS_ *INTERNAL* " demangled="gsm_mncc_facility::gsm_mncc_facility(gsm_mncc_facility const&amp;)" location="f3:131" file="f3" line="131" endline="131" inline="1">
    <Argument type="_514" location="f3:131" file="f3" line="131"/>
  </Constructor>
  <Constructor id="_385" name="gsm_mncc_facility" artificial="1" throw="" context="_60" access="public" mangled="_ZN17gsm_mncc_facilityC1Ev *INTERNAL* " demangled="gsm_mncc_facility::gsm_mncc_facility()" location="f3:131" file="f3" line="131" inline="1"/>
  <CvQualifiedType id="_9c" type="_9" const="1"/>
  <Field id="_387" name="msg_type" type="_148" offset="0" context="_83" access="public" location="f3:271" file="f3" line="271"/>
  <Field id="_388" name="callref" type="_148" offset="32" context="_83" access="public" location="f3:272" file="f3" line="272"/>
  <Field id="_389" name="data" type="_515" offset="64" context="_83" access="public" location="f3:273" file="f3" line="273"/>
  <Destructor id="_390" name="gsm_data_frame" artificial="1" throw="" context="_83" access="public" mangled="_ZN14gsm_data_frameD1Ev *INTERNAL* " demangled="gsm_data_frame::~gsm_data_frame()" location="f3:270" file="f3" line="270" endline="270" inline="1">
  </Destructor>
  <OperatorMethod id="_391" name="=" returns="_516" artificial="1" throw="" context="_83" access="public" mangled="_ZN14gsm_data_frameaSERKS_" demangled="gsm_data_frame::operator=(gsm_data_frame const&amp;)" location="f3:270" file="f3" line="270" endline="270" inline="1">
    <Argument type="_517" location="f3:270" file="f3" line="270"/>
  </OperatorMethod>
  <Constructor id="_392" name="gsm_data_frame" artificial="1" throw="" context="_83" access="public" mangled="_ZN14gsm_data_frameC1ERKS_ *INTERNAL* " demangled="gsm_data_frame::gsm_data_frame(gsm_data_frame const&amp;)" location="f3:270" file="f3" line="270" endline="270" inline="1">
    <Argument type="_517" location="f3:270" file="f3" line="270"/>
  </Constructor>
  <Constructor id="_393" name="gsm_data_frame" artificial="1" throw="" context="_83" access="public" mangled="_ZN14gsm_data_frameC1Ev *INTERNAL* " demangled="gsm_data_frame::gsm_data_frame()" location="f3:270" file="f3" line="270" inline="1"/>
  <FundamentalType id="_394" name="void" align="8"/>
  <PointerType id="_395" type="_394" size="64" align="64"/>
  <Field id="_396" name="len" type="_93" offset="0" context="_87" access="public" location="f3:137" file="f3" line="137"/>
  <Field id="_397" name="info" type="_512" offset="32" context="_87" access="public" location="f3:138" file="f3" line="138"/>
  <Destructor id="_398" name="gsm_mncc_ssversion" artificial="1" throw="" context="_87" access="public" mangled="_ZN18gsm_mncc_ssversionD1Ev *INTERNAL* " demangled="gsm_mncc_ssversion::~gsm_mncc_ssversion()" location="f3:136" file="f3" line="136" endline="136" inline="1">
  </Destructor>
  <OperatorMethod id="_399" name="=" returns="_518" artificial="1" throw="" context="_87" access="public" mangled="_ZN18gsm_mncc_ssversionaSERKS_" demangled="gsm_mncc_ssversion::operator=(gsm_mncc_ssversion const&amp;)" location="f3:136" file="f3" line="136" endline="136" inline="1">
    <Argument type="_519" location="f3:136" file="f3" line="136"/>
  </OperatorMethod>
  <Constructor id="_400" name="gsm_mncc_ssversion" artificial="1" throw="" context="_87" access="public" mangled="_ZN18gsm_mncc_ssversionC1ERKS_ *INTERNAL* " demangled="gsm_mncc_ssversion::gsm_mncc_ssversion(gsm_mncc_ssversion const&amp;)" location="f3:136" file="f3" line="136" endline="136" inline="1">
    <Argument type="_519" location="f3:136" file="f3" line="136"/>
  </Constructor>
  <Constructor id="_401" name="gsm_mncc_ssversion" artificial="1" throw="" context="_87" access="public" mangled="_ZN18gsm_mncc_ssversionC1Ev *INTERNAL* " demangled="gsm_mncc_ssversion::gsm_mncc_ssversion()" location="f3:136" file="f3" line="136" inline="1"/>
  <PointerType id="_402" type="_394c" size="64" align="64"/>
  <PointerType id="_403" type="_93" size="64" align="64"/>
  <CvQualifiedType id="_147c" type="_147" const="1"/>
  <Field id="_405" name="coding" type="_93" offset="0" context="_132" access="public" location="f3:126" file="f3" line="126"/>
  <Field id="_406" name="location" type="_93" offset="32" context="_132" access="public" location="f3:127" file="f3" line="127"/>
  <Field id="_407" name="descr" type="_93" offset="64" context="_132" access="public" location="f3:128" file="f3" line="128"/>
  <Destructor id="_408" name="gsm_mncc_progress" artificial="1" throw="" context="_132" access="public" mangled="_ZN17gsm_mncc_progressD1Ev *INTERNAL* " demangled="gsm_mncc_progress::~gsm_mncc_progress()" location="f3:125" file="f3" line="125" endline="125" inline="1">
  </Destructor>
  <OperatorMethod id="_409" name="=" returns="_521" artificial="1" throw="" context="_132" access="public" mangled="_ZN17gsm_mncc_progressaSERKS_" demangled="gsm_mncc_progress::operator=(gsm_mncc_progress const&amp;)" location="f3:125" file="f3" line="125" endline="125" inline="1">
    <Argument type="_522" location="f3:125" file="f3" line="125"/>
  </OperatorMethod>
  <Constructor id="_410" name="gsm_mncc_progress" artificial="1" throw="" context="_132" access="public" mangled="_ZN17gsm_mncc_progressC1ERKS_ *INTERNAL* " demangled="gsm_mncc_progress::gsm_mncc_progress(gsm_mncc_progress const&amp;)" location="f3:125" file="f3" line="125" endline="125" inline="1">
    <Argument type="_522" location="f3:125" file="f3" line="125"/>
  </Constructor>
  <Constructor id="_411" name="gsm_mncc_progress" artificial="1" throw="" context="_132" access="public" mangled="_ZN17gsm_mncc_progressC1Ev *INTERNAL* " demangled="gsm_mncc_progress::gsm_mncc_progress()" location="f3:125" file="f3" line="125" inline="1"/>
  <Field id="_412" name="location" type="_93" offset="0" context="_133" access="public" location="f3:111" file="f3" line="111"/>
  <Field id="_413" name="coding" type="_93" offset="32" context="_133" access="public" location="f3:112" file="f3" line="112"/>
  <Field id="_414" name="rec" type="_93" offset="64" context="_133" access="public" location="f3:113" file="f3" line="113"/>
  <Field id="_415" name="rec_val" type="_93" offset="96" context="_133" access="public" location="f3:114" file="f3" line="114"/>
  <Field id="_416" name="value" type="_93" offset="128" context="_133" access="public" location="f3:115" file="f3" line="115"/>
  <Field id="_417" name="diag_len" type="_93" offset="160" context="_133" access="public" location="f3:116" file="f3" line="116"/>
  <Field id="_418" name="diag" type="_523" offset="192" context="_133" access="public" location="f3:117" file="f3" line="117"/>
  <Destructor id="_419" name="gsm_mncc_cause" artificial="1" throw="" context="_133" access="public" mangled="_ZN14gsm_mncc_causeD1Ev *INTERNAL* " demangled="gsm_mncc_cause::~gsm_mncc_cause()" location="f3:110" file="f3" line="110" endline="110" inline="1">
  </Destructor>
  <OperatorMethod id="_420" name="=" returns="_524" artificial="1" throw="" context="_133" access="public" mangled="_ZN14gsm_mncc_causeaSERKS_" demangled="gsm_mncc_cause::operator=(gsm_mncc_cause const&amp;)" location="f3:110" file="f3" line="110" endline="110" inline="1">
    <Argument type="_525" location="f3:110" file="f3" line="110"/>
  </OperatorMethod>
  <Constructor id="_421" name="gsm_mncc_cause" artificial="1" throw="" context="_133" access="public" mangled="_ZN14gsm_mncc_causeC1ERKS_ *INTERNAL* " demangled="gsm_mncc_cause::gsm_mncc_cause(gsm_mncc_cause const&amp;)" location="f3:110" file="f3" line="110" endline="110" inline="1">
    <Argument type="_525" location="f3:110" file="f3" line="110"/>
  </Constructor>
  <Constructor id="_422" name="gsm_mncc_cause" artificial="1" throw="" context="_133" access="public" mangled="_ZN14gsm_mncc_causeC1Ev *INTERNAL* " demangled="gsm_mncc_cause::gsm_mncc_cause()" location="f3:110" file="f3" line="110" inline="1"/>
  <PointerType id="_423" type="_366" size="64" align="64"/>
  <PointerType id="_424" type="_367" size="64" align="64"/>
  <Field id="_425" name="msg_type" type="_148" offset="0" context="_226" access="public" location="f3:302" file="f3" line="302"/>
  <Field id="_426" name="callref" type="_526" offset="32" context="_226" access="public" location="f3:303" file="f3" line="303"/>
  <Destructor id="_427" name="gsm_mncc_bridge" artificial="1" throw="" context="_226" access="public" mangled="_ZN15gsm_mncc_bridgeD1Ev *INTERNAL* " demangled="gsm_mncc_bridge::~gsm_mncc_bridge()" location="f3:301" file="f3" line="301" endline="301" inline="1">
  </Destructor>
  <OperatorMethod id="_428" name="=" returns="_527" artificial="1" throw="" context="_226" access="public" mangled="_ZN15gsm_mncc_bridgeaSERKS_" demangled="gsm_mncc_bridge::operator=(gsm_mncc_bridge const&amp;)" location="f3:301" file="f3" line="301" endline="301" inline="1">
    <Argument type="_528" location="f3:301" file="f3" line="301"/>
  </OperatorMethod>
  <Constructor id="_429" name="gsm_mncc_bridge" artificial="1" throw="" context="_226" access="public" mangled="_ZN15gsm_mncc_bridgeC1ERKS_ *INTERNAL* " demangled="gsm_mncc_bridge::gsm_mncc_bridge(gsm_mncc_bridge const&amp;)" location="f3:301" file="f3" line="301" endline="301" inline="1">
    <Argument type="_528" location="f3:301" file="f3" line="301"/>
  </Constructor>
  <Constructor id="_430" name="gsm_mncc_bridge" artificial="1" throw="" context="_226" access="public" mangled="_ZN15gsm_mncc_bridgeC1Ev *INTERNAL* " demangled="gsm_mncc_bridge::gsm_mncc_bridge()" location="f3:301" file="f3" line="301" inline="1"/>
  <Field id="_431" name="proto" type="_93" offset="0" context="_232" access="public" location="f3:121" file="f3" line="121"/>
  <Field id="_432" name="info" type="_529" offset="32" context="_232" access="public" location="f3:122" file="f3" line="122"/>
  <Destructor id="_433" name="gsm_mncc_useruser" artificial="1" throw="" context="_232" access="public" mangled="_ZN17gsm_mncc_useruserD1Ev *INTERNAL* " demangled="gsm_mncc_useruser::~gsm_mncc_useruser()" location="f3:120" file="f3" line="120" endline="120" inline="1">
  </Destructor>
  <OperatorMethod id="_434" name="=" returns="_530" artificial="1" throw="" context="_232" access="public" mangled="_ZN17gsm_mncc_useruseraSERKS_" demangled="gsm_mncc_useruser::operator=(gsm_mncc_useruser const&amp;)" location="f3:120" file="f3" line="120" endline="120" inline="1">
    <Argument type="_531" location="f3:120" file="f3" line="120"/>
  </OperatorMethod>
  <Constructor id="_435" name="gsm_mncc_useruser" artificial="1" throw="" context="_232" access="public" mangled="_ZN17gsm_mncc_useruserC1ERKS_ *INTERNAL* " demangled="gsm_mncc_useruser::gsm_mncc_useruser(gsm_mncc_useruser const&amp;)" location="f3:120" file="f3" line="120" endline="120" inline="1">
    <Argument type="_531" location="f3:120" file="f3" line="120"/>
  </Constructor>
  <Constructor id="_436" name="gsm_mncc_useruser" artificial="1" throw="" context="_232" access="public" mangled="_ZN17gsm_mncc_useruserC1Ev *INTERNAL* " demangled="gsm_mncc_useruser::gsm_mncc_useruser()" location="f3:120" file="f3" line="120" inline="1"/>
  <Field id="_437" name="transfer" type="_93" offset="0" context="_238" access="public" location="f3:82" file="f3" line="82"/>
  <Field id="_438" name="mode" type="_93" offset="32" context="_238" access="public" location="f3:83" file="f3" line="83"/>
  <Field id="_439" name="coding" type="_93" offset="64" context="_238" access="public" location="f3:84" file="f3" line="84"/>
  <Field id="_440" name="radio" type="_93" offset="96" context="_238" access="public" location="f3:85" file="f3" line="85"/>
  <Field id="_441" name="speech_ctm" type="_93" offset="128" context="_238" access="public" location="f3:86" file="f3" line="86"/>
  <Field id="_442" name="speech_ver" type="_532" offset="160" context="_238" access="public" location="f3:87" file="f3" line="87"/>
  <Field id="_443" name="data" type="_444" offset="416" context="_238" access="public" location="f3:99" file="f3" line="99"/>
  <Struct id="_444" context="_238" access="public" mangled="N19gsm_mncc_bearer_cap3._0E" demangled="gsm_mncc_bearer_cap::._0" location="f3:88" file="f3" line="88" artificial="1" size="320" align="32" members="_533 _534 _535 _536 _537 _538 _539 _540 _541 _542 _543 _544 _545 _546 " bases=""/>
  <Destructor id="_445" name="gsm_mncc_bearer_cap" artificial="1" throw="" context="_238" access="public" mangled="_ZN19gsm_mncc_bearer_capD1Ev *INTERNAL* " demangled="gsm_mncc_bearer_cap::~gsm_mncc_bearer_cap()" location="f3:81" file="f3" line="81" endline="81" inline="1">
  </Destructor>
  <OperatorMethod id="_446" name="=" returns="_547" artificial="1" throw="" context="_238" access="public" mangled="_ZN19gsm_mncc_bearer_capaSERKS_" demangled="gsm_mncc_bearer_cap::operator=(gsm_mncc_bearer_cap const&amp;)" location="f3:81" file="f3" line="81" endline="81" inline="1">
    <Argument type="_548" location="f3:81" file="f3" line="81"/>
  </OperatorMethod>
  <Constructor id="_447" name="gsm_mncc_bearer_cap" artificial="1" throw="" context="_238" access="public" mangled="_ZN19gsm_mncc_bearer_capC1ERKS_ *INTERNAL* " demangled="gsm_mncc_bearer_cap::gsm_mncc_bearer_cap(gsm_mncc_bearer_cap const&amp;)" location="f3:81" file="f3" line="81" endline="81" inline="1">
    <Argument type="_548" location="f3:81" file="f3" line="81"/>
  </Constructor>
  <Constructor id="_448" name="gsm_mncc_bearer_cap" artificial="1" throw="" context="_238" access="public" mangled="_ZN19gsm_mncc_bearer_capC1Ev *INTERNAL* " demangled="gsm_mncc_bearer_cap::gsm_mncc_bearer_cap()" location="f3:81" file="f3" line="81" inline="1"/>
  <Field id="_449" name="msg_type" type="_148" offset="0" context="_254" access="public" location="f3:293" file="f3" line="293"/>
  <Field id="_450" name="callref" type="_148" offset="32" context="_254" access="public" location="f3:294" file="f3" line="294"/>
  <Field id="_451" name="ip" type="_148" offset="64" context="_254" access="public" location="f3:295" file="f3" line="295"/>
  <Field id="_452" name="port" type="_262" offset="96" context="_254" access="public" location="f3:296" file="f3" line="296"/>
  <Field id="_453" name="payload_type" type="_148" offset="128" context="_254" access="public" location="f3:297" file="f3" line="297"/>
  <Field id="_454" name="payload_msg_type" type="_148" offset="160" context="_254" access="public" location="f3:298" file="f3" line="298"/>
  <Destructor id="_455" name="gsm_mncc_rtp" artificial="1" throw="" context="_254" access="public" mangled="_ZN12gsm_mncc_rtpD1Ev *INTERNAL* " demangled="gsm_mncc_rtp::~gsm_mncc_rtp()" location="f3:292" file="f3" line="292" endline="292" inline="1">
  </Destructor>
  <OperatorMethod id="_456" name="=" returns="_549" artificial="1" throw="" context="_254" access="public" mangled="_ZN12gsm_mncc_rtpaSERKS_" demangled="gsm_mncc_rtp::operator=(gsm_mncc_rtp const&amp;)" location="f3:292" file="f3" line="292" endline="292" inline="1">
    <Argument type="_550" location="f3:292" file="f3" line="292"/>
  </OperatorMethod>
  <Constructor id="_457" name="gsm_mncc_rtp" artificial="1" throw="" context="_254" access="public" mangled="_ZN12gsm_mncc_rtpC1ERKS_ *INTERNAL* " demangled="gsm_mncc_rtp::gsm_mncc_rtp(gsm_mncc_rtp const&amp;)" location="f3:292" file="f3" line="292" endline="292" inline="1">
    <Argument type="_550" location="f3:292" file="f3" line="292"/>
  </Constructor>
  <Constructor id="_458" name="gsm_mncc_rtp" artificial="1" throw="" context="_254" access="public" mangled="_ZN12gsm_mncc_rtpC1Ev *INTERNAL* " demangled="gsm_mncc_rtp::gsm_mncc_rtp()" location="f3:292" file="f3" line="292" inline="1"/>
  <Field id="_459" name="msg_type" type="_148" offset="0" context="_265" access="public" location="f3:235" file="f3" line="235"/>
  <Field id="_460" name="callref" type="_148" offset="32" context="_265" access="public" location="f3:236" file="f3" line="236"/>
  <Field id="_461" name="fields" type="_148" offset="64" context="_265" access="public" location="f3:239" file="f3" line="239"/>
  <Field id="_462" name="bearer_cap" type="_238" offset="96" context="_265" access="public" location="f3:242" file="f3" line="242"/>
  <Field id="_463" name="called" type="_347" offset="832" context="_265" access="public" location="f3:243" file="f3" line="243"/>
  <Field id="_464" name="calling" type="_347" offset="1248" context="_265" access="public" location="f3:244" file="f3" line="244"/>
  <Field id="_465" name="redirecting" type="_347" offset="1664" context="_265" access="public" location="f3:245" file="f3" line="245"/>
  <Field id="_466" name="connected" type="_347" offset="2080" context="_265" access="public" location="f3:246" file="f3" line="246"/>
  <Field id="_467" name="cause" type="_133" offset="2496" context="_265" access="public" location="f3:247" file="f3" line="247"/>
  <Field id="_468" name="progress" type="_132" offset="2944" context="_265" access="public" location="f3:248" file="f3" line="248"/>
  <Field id="_469" name="useruser" type="_232" offset="3040" context="_265" access="public" location="f3:249" file="f3" line="249"/>
  <Field id="_470" name="facility" type="_60" offset="4128" context="_265" access="public" location="f3:250" file="f3" line="250"/>
  <Field id="_471" name="cccap" type="_27" offset="5184" context="_265" access="public" location="f3:251" file="f3" line="251"/>
  <Field id="_472" name="ssversion" type="_87" offset="5248" context="_265" access="public" location="f3:252" file="f3" line="252"/>
  <Field id="_473" name="clir" type="_482" offset="6304" context="_265" access="public" location="f3:256" file="f3" line="256"/>
  <Field id="_474" name="signal" type="_93" offset="6368" context="_265" access="public" location="f3:257" file="f3" line="257"/>
  <Field id="_475" name="keypad" type="_93" offset="6400" context="_265" access="public" location="f3:260" file="f3" line="260"/>
  <Field id="_476" name="more" type="_93" offset="6432" context="_265" access="public" location="f3:261" file="f3" line="261"/>
  <Field id="_477" name="notify" type="_93" offset="6464" context="_265" access="public" location="f3:262" file="f3" line="262"/>
  <Field id="_478" name="emergency" type="_93" offset="6496" context="_265" access="public" location="f3:263" file="f3" line="263"/>
  <Field id="_479" name="imsi" type="_551" offset="6528" context="_265" access="public" location="f3:264" file="f3" line="264"/>
  <Field id="_480" name="lchan_type" type="_272" offset="6656" context="_265" access="public" location="f3:266" file="f3" line="266"/>
  <Field id="_481" name="lchan_mode" type="_272" offset="6664" context="_265" access="public" location="f3:267" file="f3" line="267"/>
  <Struct id="_482" context="_265" access="public" mangled="N8gsm_mncc3._2E" demangled="gsm_mncc::._2" location="f3:253" file="f3" line="253" artificial="1" size="64" align="32" members="_552 _553 _554 _555 _556 _557 " bases=""/>
  <Destructor id="_483" name="gsm_mncc" artificial="1" throw="" context="_265" access="public" mangled="_ZN8gsm_mnccD1Ev *INTERNAL* " demangled="gsm_mncc::~gsm_mncc()" location="f3:233" file="f3" line="233" endline="233" inline="1">
  </Destructor>
  <OperatorMethod id="_484" name="=" returns="_558" artificial="1" throw="" context="_265" access="public" mangled="_ZN8gsm_mnccaSERKS_" demangled="gsm_mncc::operator=(gsm_mncc const&amp;)" location="f3:233" file="f3" line="233" endline="233" inline="1">
    <Argument type="_559" location="f3:233" file="f3" line="233"/>
  </OperatorMethod>
  <Constructor id="_485" name="gsm_mncc" artificial="1" throw="" context="_265" access="public" mangled="_ZN8gsm_mnccC1ERKS_ *INTERNAL* " demangled="gsm_mncc::gsm_mncc(gsm_mncc const&amp;)" location="f3:233" file="f3" line="233" endline="233" inline="1">
    <Argument type="_559" location="f3:233" file="f3" line="233"/>
  </Constructor>
  <Constructor id="_486" name="gsm_mncc" artificial="1" throw="" context="_265" access="public" mangled="_ZN8gsm_mnccC1Ev *INTERNAL* " demangled="gsm_mncc::gsm_mncc()" location="f3:233" file="f3" line="233" inline="1"/>
  <Field id="_487" name="msg_type" type="_148" offset="0" context="_327" access="public" location="f3:278" file="f3" line="278"/>
  <Field id="_488" name="version" type="_148" offset="32" context="_327" access="public" location="f3:279" file="f3" line="279"/>
  <Field id="_489" name="mncc_size" type="_148" offset="64" context="_327" access="public" location="f3:282" file="f3" line="282"/>
  <Field id="_490" name="data_frame_size" type="_148" offset="96" context="_327" access="public" location="f3:283" file="f3" line="283"/>
  <Field id="_491" name="called_offset" type="_148" offset="128" context="_327" access="public" location="f3:286" file="f3" line="286"/>
  <Field id="_492" name="signal_offset" type="_148" offset="160" context="_327" access="public" location="f3:287" file="f3" line="287"/>
  <Field id="_493" name="emergency_offset" type="_148" offset="192" context="_327" access="public" location="f3:288" file="f3" line="288"/>
  <Field id="_494" name="lchan_type_offset" type="_148" offset="224" context="_327" access="public" location="f3:289" file="f3" line="289"/>
  <Destructor id="_495" name="gsm_mncc_hello" artificial="1" throw="" context="_327" access="public" mangled="_ZN14gsm_mncc_helloD1Ev *INTERNAL* " demangled="gsm_mncc_hello::~gsm_mncc_hello()" location="f3:277" file="f3" line="277" endline="277" inline="1">
  </Destructor>
  <OperatorMethod id="_496" name="=" returns="_560" artificial="1" throw="" context="_327" access="public" mangled="_ZN14gsm_mncc_helloaSERKS_" demangled="gsm_mncc_hello::operator=(gsm_mncc_hello const&amp;)" location="f3:277" file="f3" line="277" endline="277" inline="1">
    <Argument type="_561" location="f3:277" file="f3" line="277"/>
  </OperatorMethod>
  <Constructor id="_497" name="gsm_mncc_hello" artificial="1" throw="" context="_327" access="public" mangled="_ZN14gsm_mncc_helloC1ERKS_ *INTERNAL* " demangled="gsm_mncc_hello::gsm_mncc_hello(gsm_mncc_hello const&amp;)" location="f3:277" file="f3" line="277" endline="277" inline="1">
    <Argument type="_561" location="f3:277" file="f3" line="277"/>
  </Constructor>
  <Constructor id="_498" name="gsm_mncc_hello" artificial="1" throw="" context="_327" access="public" mangled="_ZN14gsm_mncc_helloC1Ev *INTERNAL* " demangled="gsm_mncc_hello::gsm_mncc_hello()" location="f3:277" file="f3" line="277" inline="1"/>
  <Field id="_499" name="type" type="_93" offset="0" context="_347" access="public" location="f3:103" file="f3" line="103"/>
  <Field id="_500" name="plan" type="_93" offset="32" context="_347" access="public" location="f3:104" file="f3" line="104"/>
  <Field id="_501" name="present" type="_93" offset="64" context="_347" access="public" location="f3:105" file="f3" line="105"/>
  <Field id="_502" name="screen" type="_93" offset="96" context="_347" access="public" location="f3:106" file="f3" line="106"/>
  <Field id="_503" name="number" type="_562" offset="128" context="_347" access="public" location="f3:107" file="f3" line="107"/>
  <Destructor id="_504" name="gsm_mncc_number" artificial="1" throw="" context="_347" access="public" mangled="_ZN15gsm_mncc_numberD1Ev *INTERNAL* " demangled="gsm_mncc_number::~gsm_mncc_number()" location="f3:102" file="f3" line="102" endline="102" inline="1">
  </Destructor>
  <OperatorMethod id="_505" name="=" returns="_563" artificial="1" throw="" context="_347" access="public" mangled="_ZN15gsm_mncc_numberaSERKS_" demangled="gsm_mncc_number::operator=(gsm_mncc_number const&amp;)" location="f3:102" file="f3" line="102" endline="102" inline="1">
    <Argument type="_564" location="f3:102" file="f3" line="102"/>
  </OperatorMethod>
  <Constructor id="_506" name="gsm_mncc_number" artificial="1" throw="" context="_347" access="public" mangled="_ZN15gsm_mncc_numberC1ERKS_ *INTERNAL* " demangled="gsm_mncc_number::gsm_mncc_number(gsm_mncc_number const&amp;)" location="f3:102" file="f3" line="102" endline="102" inline="1">
    <Argument type="_564" location="f3:102" file="f3" line="102"/>
  </Constructor>
  <Constructor id="_507" name="gsm_mncc_number" artificial="1" throw="" context="_347" access="public" mangled="_ZN15gsm_mncc_numberC1Ev *INTERNAL* " demangled="gsm_mncc_number::gsm_mncc_number()" location="f3:102" file="f3" line="102" inline="1"/>
  <ReferenceType id="_510" type="_27" size="64" align="64"/>
  <ReferenceType id="_511" type="_27c" size="64" align="64"/>
  <ArrayType id="_512" min="0" max="127u" type="_508" size="1024" align="8"/>
  <ReferenceType id="_513" type="_60" size="64" align="64"/>
  <ReferenceType id="_514" type="_60c" size="64" align="64"/>
  <ArrayType id="_515" min="0" max="0xffffffffffffffffffffffffffffffffu" type="_272" size="0" align="8"/>
  <ReferenceType id="_516" type="_83" size="64" align="64"/>
  <ReferenceType id="_517" type="_83c" size="64" align="64"/>
  <ReferenceType id="_518" type="_87" size="64" align="64"/>
  <ReferenceType id="_519" type="_87c" size="64" align="64"/>
  <ReferenceType id="_521" type="_132" size="64" align="64"/>
  <ReferenceType id="_522" type="_132c" size="64" align="64"/>
  <ArrayType id="_523" min="0" max="31u" type="_508" size="256" align="8"/>
  <ReferenceType id="_524" type="_133" size="64" align="64"/>
  <ReferenceType id="_525" type="_133c" size="64" align="64"/>
  <ArrayType id="_526" min="0" max="1u" type="_148" size="64" align="32"/>
  <ReferenceType id="_527" type="_226" size="64" align="64"/>
  <ReferenceType id="_528" type="_226c" size="64" align="64"/>
  <ArrayType id="_529" min="0" max="128u" type="_508" size="1032" align="8"/>
  <ReferenceType id="_530" type="_232" size="64" align="64"/>
  <ReferenceType id="_531" type="_232c" size="64" align="64"/>
  <ArrayType id="_532" min="0" max="7u" type="_93" size="256" align="32"/>
  <Field id="_533" name="rate_adaption" type="_105" offset="0" context="_444" access="public" location="f3:89" file="f3" line="89"/>
  <Field id="_534" name="sig_access" type="_71" offset="32" context="_444" access="public" location="f3:90" file="f3" line="90"/>
  <Field id="_535" name="async" type="_93" offset="64" context="_444" access="public" location="f3:91" file="f3" line="91"/>
  <Field id="_536" name="nr_stop_bits" type="_93" offset="96" context="_444" access="public" location="f3:92" file="f3" line="92"/>
  <Field id="_537" name="nr_data_bits" type="_93" offset="128" context="_444" access="public" location="f3:93" file="f3" line="93"/>
  <Field id="_538" name="user_rate" type="_167" offset="160" context="_444" access="public" location="f3:94" file="f3" line="94"/>
  <Field id="_539" name="parity" type="_333" offset="192" context="_444" access="public" location="f3:95" file="f3" line="95"/>
  <Field id="_540" name="interm_rate" type="_299" offset="224" context="_444" access="public" location="f3:96" file="f3" line="96"/>
  <Field id="_541" name="transp" type="_141" offset="256" context="_444" access="public" location="f3:97" file="f3" line="97"/>
  <Field id="_542" name="modem_type" type="_153" offset="288" context="_444" access="public" location="f3:98" file="f3" line="98"/>
  <Destructor id="_543" name="._0" artificial="1" throw="" context="_444" access="public" mangled="_ZN19gsm_mncc_bearer_cap3._0D1Ev *INTERNAL* " demangled="gsm_mncc_bearer_cap::._0::~._0()" location="f3:88" file="f3" line="88" endline="88" inline="1">
  </Destructor>
  <OperatorMethod id="_544" name="=" returns="_573" artificial="1" throw="" context="_444" access="public" mangled="_ZN19gsm_mncc_bearer_cap3._0aSERKS0_" demangled="gsm_mncc_bearer_cap::._0::operator=(gsm_mncc_bearer_cap::._0 const&amp;)" location="f3:88" file="f3" line="88" endline="88" inline="1">
    <Argument type="_574" location="f3:88" file="f3" line="88"/>
  </OperatorMethod>
  <Constructor id="_545" artificial="1" throw="" context="_444" access="public" mangled="_ZN19gsm_mncc_bearer_cap3._0C1ERKS0_ *INTERNAL* " demangled="gsm_mncc_bearer_cap::._0::._0(gsm_mncc_bearer_cap::._0 const&amp;)" location="f3:88" file="f3" line="88" endline="88" inline="1">
    <Argument type="_574" location="f3:88" file="f3" line="88"/>
  </Constructor>
  <Constructor id="_546" artificial="1" throw="" context="_444" access="public" mangled="_ZN19gsm_mncc_bearer_cap3._0C1Ev *INTERNAL* " demangled="gsm_mncc_bearer_cap::._0::._0()" location="f3:88" file="f3" line="88" inline="1"/>
  <ReferenceType id="_547" type="_238" size="64" align="64"/>
  <ReferenceType id="_548" type="_238c" size="64" align="64"/>
  <ReferenceType id="_549" type="_254" size="64" align="64"/>
  <ReferenceType id="_550" type="_254c" size="64" align="64"/>
  <ArrayType id="_551" min="0" max="15u" type="_508" size="128" align="8"/>
  <Field id="_552" name="sup" type="_93" offset="0" context="_482" access="public" location="f3:254" file="f3" line="254"/>
  <Field id="_553" name="inv" type="_93" offset="32" context="_482" access="public" location="f3:255" file="f3" line="255"/>
  <Destructor id="_554" name="._2" artificial="1" throw="" context="_482" access="public" mangled="_ZN8gsm_mncc3._2D1Ev *INTERNAL* " demangled="gsm_mncc::._2::~._2()" location="f3:253" file="f3" line="253" endline="253" inline="1">
  </Destructor>
  <OperatorMethod id="_555" name="=" returns="_577" artificial="1" throw="" context="_482" access="public" mangled="_ZN8gsm_mncc3._2aSERKS0_" demangled="gsm_mncc::._2::operator=(gsm_mncc::._2 const&amp;)" location="f3:253" file="f3" line="253" endline="253" inline="1">
    <Argument type="_578" location="f3:253" file="f3" line="253"/>
  </OperatorMethod>
  <Constructor id="_556" artificial="1" throw="" context="_482" access="public" mangled="_ZN8gsm_mncc3._2C1ERKS0_ *INTERNAL* " demangled="gsm_mncc::._2::._2(gsm_mncc::._2 const&amp;)" location="f3:253" file="f3" line="253" endline="253" inline="1">
    <Argument type="_578" location="f3:253" file="f3" line="253"/>
  </Constructor>
  <Constructor id="_557" artificial="1" throw="" context="_482" access="public" mangled="_ZN8gsm_mncc3._2C1Ev *INTERNAL* " demangled="gsm_mncc::._2::._2()" location="f3:253" file="f3" line="253" inline="1"/>
  <ReferenceType id="_558" type="_265" size="64" align="64"/>
  <ReferenceType id="_559" type="_265c" size="64" align="64"/>
  <ReferenceType id="_560" type="_327" size="64" align="64"/>
  <ReferenceType id="_561" type="_327c" size="64" align="64"/>
  <ArrayType id="_562" min="0" max="32u" type="_508" size="264" align="8"/>
  <ReferenceType id="_563" type="_347" size="64" align="64"/>
  <ReferenceType id="_564" type="_347c" size="64" align="64"/>
  <FundamentalType id="_508" name="char" size="8" align="8"/>
  <ReferenceType id="_573" type="_444" size="64" align="64"/>
  <ReferenceType id="_574" type="_444c" size="64" align="64"/>
  <ReferenceType id="_577" type="_482" size="64" align="64"/>
  <ReferenceType id="_578" type="_482c" size="64" align="64"/>
  <CvQualifiedType id="_508c" type="_508" const="1"/>
  <CvQualifiedType id="_394c" type="_394" const="1"/>
  <CvQualifiedType id="_444c" type="_444" const="1"/>
  <CvQualifiedType id="_238c" type="_238" const="1"/>
  <CvQualifiedType id="_347c" type="_347" const="1"/>
  <CvQualifiedType id="_133c" type="_133" const="1"/>
  <CvQualifiedType id="_232c" type="_232" const="1"/>
  <CvQualifiedType id="_132c" type="_132" const="1"/>
  <CvQualifiedType id="_60c" type="_60" const="1"/>
  <CvQualifiedType id="_87c" type="_87" const="1"/>
  <CvQualifiedType id="_27c" type="_27" const="1"/>
  <CvQualifiedType id="_482c" type="_482" const="1"/>
  <CvQualifiedType id="_265c" type="_265" const="1"/>
  <CvQualifiedType id="_83c" type="_83" const="1"/>
  <CvQualifiedType id="_327c" type="_327" const="1"/>
  <CvQualifiedType id="_254c" type="_254" const="1"/>
  <CvQualifiedType id="_226c" type="_226" const="1"/>
  <File id="f0" name="/usr/share/gccxml-0.9/GCC/4.9/gccxml_builtins.h"/>
  <File id="f1" name="/tmp/tmpkc59SI.cpp"/>
  <File id="f2" name="/usr/include/stdint.h"/>
  <File id="f3" name="/tmp/./mncc.h"/>
  <CPP_DUMP name="functions"><![CDATA[INT16_C(c) c
INT32_C(c) c
INT64_C(c) c ## L
INT8_C(c) c
INTMAX_C(c) c ## L
UINT16_C(c) c
UINT32_C(c) c ## U
UINT64_C(c) c ## UL
UINT8_C(c) c
UINTMAX_C(c) c ## UL
__ASMNAME(cname) __ASMNAME2 (__USER_LABEL_PREFIX__, cname)
__ASMNAME2(prefix,cname) __STRING (prefix) cname
__CONCAT(x,y) x ## y
__GLIBC_PREREQ(maj,min) ((__GLIBC__ << 16) + __GLIBC_MINOR__ >= ((maj) << 16) + (min))
__GNUC_PREREQ(maj,min) ((__GNUC__ << 16) + __GNUC_MINOR__ >= ((maj) << 16) + (min))
__LDBL_REDIR(name,proto) name proto
__LDBL_REDIR1(name,proto,alias) name proto
__LDBL_REDIR1_NTH(name,proto,alias) name proto __THROW
__LDBL_REDIR_NTH(name,proto) name proto __THROW
__NTH(fct) __LEAF_ATTR fct throw ()
__P(args) args
__PMT(args) args
__REDIRECT(name,proto,alias) name proto __asm__ (__ASMNAME (#alias))
